{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/kahrens/Dropbox (PP)/StataLasso/Current/cs_cvlasso.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Oct 2019, 09:08:32
{txt}r; t=0.00 9:08:32

{com}. about

{txt}Stata/SE 16.0 for Mac (64-bit Intel)
Revision 26 Jun 2019
Copyright 1985-2019 StataCorp LLC

Total physical memory: {res}  16.00 GB

145-user Stata network perpetual license:
       Serial number:  401606202915
         Licensed to:  Staff
                       ETH Zurich
{txt}r; t=0.00 9:08:32

{com}. which cvlasso
{txt}./cvlasso.ado
{res}*! cvlasso 1.0.09 28jun2019
*! lassopack package 1.3.1
*! authors aa/ms
{txt}r; t=0.00 9:08:32

{com}. which lasso2
{txt}./lasso2.ado
{res}*! lasso2 1.0.10 14oct2019
*! lassopack package 1.3.1
*! authors aa/ms
{txt}r; t=0.00 9:08:32

{com}. which lasso2_p
{txt}./lasso2_p.ado
{res}*! lasso2_p 1.0.06 14oct2019
*! lassopack package 1.3.1
*! authors aa/ms
{txt}r; t=0.00 9:08:32

{com}. which lassoutils
{txt}./lassoutils.ado
{res}*! lassoutils 1.1.04 14oct2019
*! lassopack package 1.3.1
*! authors aa/cbh/ms
{txt}r; t=0.00 9:08:32

{com}. 
. * data source
. global prostate prostate.data
{txt}r; t=0.00 9:08:32

{com}. *global prostate https://web.stanford.edu/~hastie/ElemStatLearn/datasets/prostate.data
. 
. * program to compare two matrices in terms of avg abs deviation
. cap program drop comparemat
{txt}r; t=0.00 9:08:32

{com}. program define comparemat , rclass
{txt}  1{com}.         syntax anything [, tol(real 10e-3)] 
{txt}  2{com}.         local A         : word 1 of `0'
{txt}  3{com}.         local B         : word 2 of `0'
{txt}  4{com}.         tempname Amat Bmat
{txt}  5{com}.         mat `Amat' = `A'
{txt}  6{com}.         mat `Bmat' = `B'
{txt}  7{com}.         local diff=mreldif(`Amat',`Bmat')
{txt}  8{com}.         di as text "mreldif=`diff'. tolerance = `tol'"
{txt}  9{com}.         mat list `Amat'
{txt} 10{com}.         mat list `Bmat'
{txt} 11{com}.         return scalar mreldif = `diff'
{txt} 12{com}.         assert `diff'<`tol'
{txt} 13{com}. end
{txt}r; t=0.00 9:08:32

{com}. 
. 
. set seed 123456
{txt}r; t=0.00 9:08:32

{com}. 
. ********************************************************************************
. *** compare with glmnet                                                                  ***
. ********************************************************************************
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 9:08:32

{com}. drop if _n==97 // to ensure same size for each fold
{txt}(1 observation deleted)
r; t=0.00 9:08:32

{com}. 
. global model lpsa lcavol lweight age lbph svi lcp gleason pgg45
{txt}r; t=0.00 9:08:32

{com}. 
. * generate fold variable
. gen myfid = 1 if _n<=32
{txt}(64 missing values generated)
r; t=0.00 9:08:32

{com}. replace myfid = 2 if _n>32 & _n<=64
{txt}(32 real changes made)
r; t=0.00 9:08:32

{com}. replace myfid = 3 if _n>64
{txt}(32 real changes made)
r; t=0.00 9:08:32

{com}. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5)
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 2.3865184 {space 3} {res} 1.1559279  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.4635023 {space 3} {res} .42894674  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.485229 {space 3} {res} .36948736  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=0.20 9:08:33

{com}. mat L = e(mmspe)
{txt}r; t=0.00 9:08:33

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=TRUE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 2.386518 1.463497 1.484953
> > var(predict(c,newx=X,s="lambda.min"))
>          1
> 1 0.608541
> */
. mat G = ( 2.38651835211576 \ 1.46349718052732 \ 1.48495268875459 )
{txt}r; t=0.00 9:08:33

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0001112103984058. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 2.3865184
{txt}c2 {res} 1.4635023
{txt}c3 {res}  1.485229
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 2.3865184
{txt}r2 {res} 1.4634972
{txt}r3 {res} 1.4849527
{reset}r; t=0.00 9:08:33

{com}. cap drop xb
{txt}r; t=0.00 9:08:33

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=15 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4705447      0.4939937
{txt}{space 10}lweight {c |}{col 21}{res}      0.4738822      0.5463838
{txt}{space 13}lbph {c |}{col 21}{res}      0.0222266      0.0675109
{txt}{space 14}svi {c |}{col 21}{res}      0.4597209      0.5816563
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021287      0.0033429
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.0467006     -0.4001276
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.01 9:08:33

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446048    .7801003   .9116189   4.111986
{txt}r; t=0.00 9:08:33

{com}. assert reldif(0.608541,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 9:08:33

{com}. 
. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) prestd
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 2.3865184 {space 3} {res} 1.1559279  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.4635023 {space 3} {res} .42894674  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.485229 {space 3} {res} .36948736  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=0.02 9:08:33

{com}. mat L = e(mmspe)
{txt}r; t=0.00 9:08:33

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=TRUE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 2.386518 1.463497 1.484953
> > var(predict(c,newx=X,s="lambda.min"))
>          1
> 1 0.608541
> */
. mat G = ( 2.38651835211576 \ 1.46349718052732 \ 1.48495268875459 )
{txt}r; t=0.00 9:08:33

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0001112103968545. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 2.3865184
{txt}c2 {res} 1.4635023
{txt}c3 {res}  1.485229
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 2.3865184
{txt}r2 {res} 1.4634972
{txt}r3 {res} 1.4849527
{reset}r; t=0.00 9:08:33

{com}. cap drop xb
{txt}r; t=0.00 9:08:33

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=15 (lopt).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4705447      0.4939937
{txt}{space 10}lweight {c |}{col 21}{res}      0.4738822      0.5463838
{txt}{space 13}lbph {c |}{col 21}{res}      0.0222266      0.0675109
{txt}{space 14}svi {c |}{col 21}{res}      0.4597209      0.5816563
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021287      0.0033429
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.0467006     -0.4001276
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.08 9:08:33

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446048    .7801003   .9116189   4.111986
{txt}r; t=0.00 9:08:33

{com}. assert reldif(0.608541,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 9:08:33

{com}. 
. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) unitload
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 2.1036977 {space 3} {res} .86238904  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.4298598 {space 3} {res} .47710985  ^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res} 1.4275375 {space 3} {res} .35365915  *
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lopt is at the limit of the lambda range.
{txt}r; t=0.02 9:08:33

{com}. mat L = e(mmspe)
{txt}r; t=0.00 9:08:33

{com}. /*
> > # cross-validation with intercept & standardisation
> > c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=TRUE,standardize=FALSE)
> > c$cvm # mean-squared prediction error
> [1] 2.103697 1.429934 1.427561
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.7840688
> */ 
. mat G = ( 2.10369705382686 \ 1.42993421234064 \ 1.42756055333919 )
{txt}r; t=0.00 9:08:33

{com}. comparemat L G // compare coeffs
{txt}mreldif=.000030615518138. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 2.1036977
{txt}c2 {res} 1.4298598
{txt}c3 {res} 1.4275375
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 2.1036971
{txt}r2 {res} 1.4299342
{txt}r3 {res} 1.4275606
{reset}r; t=0.00 9:08:33

{com}. cap drop xb
{txt}r; t=0.00 9:08:33

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=1.5 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.5568426      0.5653571
{txt}{space 10}lweight {c |}{col 21}{res}      0.5707438      0.6139211
{txt}{space 14}age {c |}{col 21}{res}     -0.0208973     -0.0224946
{txt}{space 13}lbph {c |}{col 21}{res}      0.0911393      0.0935981
{txt}{space 14}svi {c |}{col 21}{res}      0.6204808      0.7149700
{txt}{space 14}lcp {c |}{col 21}{res}     -0.1126800     -0.1447125
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0068648      0.0071245
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}      0.6415930      0.5426554
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=1.5).
r; t=0.01 9:08:33

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446048    .8854875    .513909   4.598263
{txt}r; t=0.00 9:08:33

{com}. assert reldif(0.7840688,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 9:08:33

{com}. 
. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) nocons unitload
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 1.9998833 {space 3} {res} .72964224  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res}   1.26607 {space 3} {res} .39073554  ^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.246129 {space 3} {res} .28903645  *
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lopt is at the limit of the lambda range.
{txt}r; t=0.07 9:08:33

{com}. mat L = e(mmspe)
{txt}r; t=0.00 9:08:33

{com}. /*
> > c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=FALSE,standardize=FALSE)
> > c$cvm # mean-squared prediction error
> [1] 1.999806 1.266384 1.246805
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.7919695
> */
. mat G = ( 1.99980614859113 \ 1.26638436668758 \ 1.24680539174676 )
{txt}r; t=0.00 9:08:33

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0003010649455664. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 1.9998833
{txt}c2 {res}   1.26607
{txt}c3 {res}  1.246129
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 1.9998061
{txt}r2 {res} 1.2663844
{txt}r3 {res} 1.2468054
{reset}r; t=0.00 9:08:33

{com}. cap drop xb
{txt}r; t=0.00 9:08:33

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=1.5 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.5473610      0.5569029
{txt}{space 10}lweight {c |}{col 21}{res}      0.6258035      0.6453516
{txt}{space 14}age {c |}{col 21}{res}     -0.0188110     -0.0217852
{txt}{space 13}lbph {c |}{col 21}{res}      0.0801178      0.0880196
{txt}{space 14}svi {c |}{col 21}{res}      0.6260775      0.7250462
{txt}{space 14}lcp {c |}{col 21}{res}     -0.1142476     -0.1460891
{txt}{space 10}gleason {c |}{col 21}{res}      0.0505847      0.0620963
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0059407      0.0060062
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=1.5).
r; t=0.02 9:08:33

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.443933    .8905195   .5327895   4.561406
{txt}r; t=0.00 9:08:33

{com}. assert reldif(0.7919695,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 9:08:33

{com}. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) nocons
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 1.9069161 {space 3} {res} .92525083  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.2339936 {space 3} {res} .35347077  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.309495 {space 3} {res}  .3270498  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=0.09 9:08:33

{com}. mat L = e(mmspe)
{txt}r; t=0.00 9:08:33

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=FALSE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 1.906526 1.232220 1.310531
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.6062457
> */
. mat G = ( 1.90652583524832 \ 1.23222044017428 \ 1.31053116174191 )
{txt}r; t=0.00 9:08:33

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0007943382997762. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 1.9069161
{txt}c2 {res} 1.2339936
{txt}c3 {res}  1.309495
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 1.9065258
{txt}r2 {res} 1.2322204
{txt}r3 {res} 1.3105312
{reset}r; t=0.00 9:08:33

{com}. cap drop xb
{txt}r; t=0.00 9:08:33

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=15 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4712765      0.5002634
{txt}{space 10}lweight {c |}{col 21}{res}      0.4608978      0.4351342
{txt}{space 13}lbph {c |}{col 21}{res}      0.0239597      0.0823598
{txt}{space 14}svi {c |}{col 21}{res}      0.4613426      0.5955516
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021037      0.0031282
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.01 9:08:33

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446541    .7785216   .9124108     4.1091
{txt}r; t=0.00 9:08:33

{com}. assert reldif(0.6062457,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 9:08:33

{com}. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) nocons prestd
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 1.9069161 {space 3} {res} .92525083  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.2339936 {space 3} {res} .35347077  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.309495 {space 3} {res}  .3270498  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=0.11 9:08:33

{com}. mat L = e(mmspe)
{txt}r; t=0.00 9:08:33

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=FALSE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 1.906526 1.232220 1.310531
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.6062457
> */
. mat G = ( 1.90652583524832 \ 1.23222044017428 \ 1.31053116174191 )
{txt}r; t=0.00 9:08:33

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0007943382600105. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 1.9069161
{txt}c2 {res} 1.2339936
{txt}c3 {res}  1.309495
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 1.9065258
{txt}r2 {res} 1.2322204
{txt}r3 {res} 1.3105312
{reset}r; t=0.00 9:08:33

{com}. cap drop xb
{txt}r; t=0.00 9:08:33

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=15 (lopt).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4712765      0.5002634
{txt}{space 10}lweight {c |}{col 21}{res}      0.4608978      0.4351342
{txt}{space 13}lbph {c |}{col 21}{res}      0.0239597      0.0823598
{txt}{space 14}svi {c |}{col 21}{res}      0.4613426      0.5955516
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021037      0.0031282
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.01 9:08:33

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446541    .7785216   .9124108     4.1091
{txt}r; t=0.00 9:08:33

{com}. assert reldif(0.6062457,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 9:08:33

{com}. 
. 
. ********************************************************************************
. *** validate                                                        ***
. ********************************************************************************
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 9:08:33

{com}.  
. global model lpsa lcavol lweight age lbph svi lcp gleason pgg45
{txt}r; t=0.00 9:08:33

{com}. gen sample = _n<70 
{txt}r; t=0.00 9:08:33

{com}.  
. foreach type of newlist lopt lse {c -(} 
{txt}  2{com}.  
. local type lse 
{txt}  3{com}.  
. // check that right beta is used for predict
. // also validates that "if" works 
. cvlasso $model if sample
{txt}  4{com}. local mylopt = e(`type')
{txt}  5{com}. cap drop myxb  
{txt}  6{com}. predict double myxb if !sample, xb `type' postres
{txt}  7{com}. mat A = e(b)
{txt}  8{com}. 
. lasso2 $model if sample, lambda(`mylopt')
{txt}  9{com}. cap drop myxb2
{txt} 10{com}. predict double myxb2 if !sample, xb
{txt} 11{com}. mat B = e(b)
{txt} 12{com}. 
. comparemat A B
{txt} 13{com}. assert myxb2==myxb
{txt} 14{com}. 
. // and now with alpha list
. cvlasso $model if sample, alpha(0 0.3 0.7 1)
{txt} 15{com}. local mylopt = e(`type')
{txt} 16{com}. local myalpha = e(alphamin)
{txt} 17{com}. cap drop myr
{txt} 18{com}. predict double myr if !sample, r `type' postres
{txt} 19{com}. mat A = e(b)
{txt} 20{com}. 
. lasso2 $model if sample, lambda(`mylopt') alpha(`myalpha') 
{txt} 21{com}. cap drop myr2
{txt} 22{com}. predict double myr2 if !sample, r
{txt} 23{com}. mat B = e(b)
{txt} 24{com}. 
. comparemat A B
{txt} 25{com}. assert myr2==myr
{txt} 26{com}. 
. {c )-}

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .70214335 {space 3} {res} .13668767  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .68166758 {space 3} {res} .13770442  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .65032545 {space 3} {res} .13589084  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .61368184 {space 3} {res} .12902249  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .57648569 {space 3} {res} .11951189  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res}  .5455564 {space 3} {res} .11125054  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .52022373 {space 3} {res} .10413738  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .49994965 {space 3} {res} .09808444  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .48394209 {space 3} {res} .09299888  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res}  .4715922 {space 3} {res} .08866583  ^
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .46159647 {space 3} {res} .08503773  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .45319845 {space 3} {res}  .0819249  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .44655158 {space 3} {res} .07921285  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .43989318 {space 3} {res} .07690231  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .43416143 {space 3} {res} .07503205  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .42831327 {space 3} {res} .07332298  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .42328622 {space 3} {res} .07186312  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .41910109 {space 3} {res} .07059817  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .41541784 {space 3} {res} .06940436  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .41239688 {space 3} {res} .06842274  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .41115051 {space 3} {res} .06762829  *
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .41125524 {space 3} {res} .06734084  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .41189673 {space 3} {res} .06726297  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .41299996 {space 3} {res} .06716497  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .41535333 {space 3} {res} .06772844  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .41747426 {space 3} {res} .06851425  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .41770086 {space 3} {res} .06978754  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res}  .4181799 {space 3} {res}  .0710678  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .41875104 {space 3} {res} .07232996  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .41856902 {space 3} {res} .07315811  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .41843711 {space 3} {res} .07413117  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res}   .418418 {space 3} {res} .07512313  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .41815181 {space 3} {res}  .0761924  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .41800644 {space 3} {res} .07722359  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .41773766 {space 3} {res} .07810692  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .41776606 {space 3} {res} .07897215  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .41784915 {space 3} {res} .07973505  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res}  .4178434 {space 3} {res}  .0803494  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .41783315 {space 3} {res} .08086973  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res}  .4177931 {space 3} {res} .08133498  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .41780825 {space 3} {res} .08175923  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res}  .4178703 {space 3} {res} .08214655  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .41796691 {space 3} {res} .08250007  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .41808819 {space 3} {res}  .0828227  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .41822631 {space 3} {res} .08311707  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .41837509 {space 3} {res} .08338564  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .41872946 {space 3} {res} .08363953  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .41907617 {space 3} {res} .08387238  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .41940754 {space 3} {res} .08408564  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .41972231 {space 3} {res} .08428089  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .42001978 {space 3} {res} .08445959  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .42029967 {space 3} {res} .08462309  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .42056204 {space 3} {res} .08477263  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res}  .4208072 {space 3} {res} .08490936  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .42103565 {space 3} {res} .08503435  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .42124801 {space 3} {res} .08514857  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .42144499 {space 3} {res} .08525293  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .42162738 {space 3} {res} .08534826  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .42179596 {space 3} {res} .08543531  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .42195157 {space 3} {res} .08551481  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .42209501 {space 3} {res} .08558737  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .42222708 {space 3} {res} .08565361  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .42234856 {space 3} {res} .08571407  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .42246021 {space 3} {res} .08576923  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .42256272 {space 3} {res} .08581956  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .42265677 {space 3} {res} .08586548  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .42274302 {space 3} {res} .08590737  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .42282205 {space 3} {res} .08594557  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .42289444 {space 3} {res} .08598041  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .42296071 {space 3} {res} .08601219  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .42302135 {space 3} {res} .08604116  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .42307681 {space 3} {res} .08606758  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .42312753 {space 3} {res} .08609167  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .42317389 {space 3} {res} .08611363  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .42321625 {space 3} {res} .08613366  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .42325495 {space 3} {res} .08615191  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res}  .4232903 {space 3} {res} .08616855  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .42332257 {space 3} {res} .08618371  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .42335204 {space 3} {res} .08619754  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .42337894 {space 3} {res} .08621014  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .42340349 {space 3} {res} .08622162  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .42342589 {space 3} {res} .08623209  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .42344633 {space 3} {res} .08624163  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .42346497 {space 3} {res} .08625033  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .42348198 {space 3} {res} .08625825  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res}  .4234975 {space 3} {res} .08626547  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .42351165 {space 3} {res} .08627205  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .42352455 {space 3} {res} .08627805  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .42353631 {space 3} {res} .08628352  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .42354704 {space 3} {res}  .0862885  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .42355682 {space 3} {res} .08629303  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .42356574 {space 3} {res} .08629717  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .42357387 {space 3} {res} .08630094  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .42358128 {space 3} {res} .08630437  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .42358803 {space 3} {res}  .0863075  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .42359419 {space 3} {res} .08631036  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .42359981 {space 3} {res} .08631295  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .42360492 {space 3} {res} .08631532  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .42360958 {space 3} {res} .08631748  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .42361383 {space 3} {res} .08631945  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
Estimate lasso with lambda=28.078 (lse).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2177045      0.3782994
{txt}{space 10}lweight {c |}{col 21}{res}      0.4397825      0.8391637
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}      0.1812277     -1.3919237
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=28.07802540248).
(69 missing values generated)

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2177045      0.3782994
{txt}{space 10}lweight {c |}{col 21}{res}      0.4397825      0.8391637
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}      0.1812277     -1.3919237
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=28.07802540248).
(69 missing values generated)
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,3]
       lcavol    lweight      _cons
y1 {res} .21770447  .43978251  .18122774
{reset}{res}
{txt}__000001[1,3]
       lcavol    lweight      _cons
y1 {res} .21770447  .43978251  .18122774
{reset}
K-fold cross-validation with 10 folds. Elastic net with alpha=0.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res}  .4058132 {space 3} {res} .06221679  ^
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .40324694 {space 3} {res} .06142219  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .40092895 {space 3} {res} .06074386  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .39886836 {space 3} {res}  .0601891  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .39704166 {space 3} {res} .05974469  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .39544472 {space 3} {res} .05940836  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .39406688 {space 3} {res} .05917335  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .39289627 {space 3} {res} .05903176  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .39192004 {space 3} {res} .05897483  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .39112448 {space 3} {res} .05899333  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .39049534 {space 3} {res} .05907774  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .39001796 {space 3} {res} .05921862  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .38967762 {space 3} {res} .05940678  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .38945964 {space 3} {res}  .0596335  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .38934968 {space 3} {res} .05989068  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .38933388 {space 3} {res} .06017092  *
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .38939902 {space 3} {res} .06046757  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .38953267 {space 3} {res} .06077479  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .38972324 {space 3} {res} .06108748  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .38996011 {space 3} {res} .06140132  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .39023361 {space 3} {res} .06171267  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .39053506 {space 3} {res} .06201856  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .39085677 {space 3} {res} .06231659  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res}   .391192 {space 3} {res} .06260488  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .39153492 {space 3} {res} .06288201  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .39188054 {space 3} {res} .06314697  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .39222469 {space 3} {res} .06339906  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .39256391 {space 3} {res}  .0636379  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .39289538 {space 3} {res} .06386333  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .39321688 {space 3} {res} .06407537  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .39352671 {space 3} {res} .06427422  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .39382361 {space 3} {res}  .0644602  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .39410669 {space 3} {res} .06463371  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .39437542 {space 3} {res} .06479524  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .39462951 {space 3} {res} .06494531  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .39486892 {space 3} {res} .06508449  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .39509378 {space 3} {res} .06521336  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .39530438 {space 3} {res}  .0653325  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .39550113 {space 3} {res} .06544252  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .39568451 {space 3} {res} .06554397  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .39585508 {space 3} {res} .06563744  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .39601343 {space 3} {res} .06572345  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .39616019 {space 3} {res} .06580254  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .39629599 {space 3} {res}  .0658752  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .39642149 {space 3} {res} .06594191  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res}  .3965373 {space 3} {res} .06600311  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .39664407 {space 3} {res} .06605922  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .39674238 {space 3} {res} .06611064  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .39683283 {space 3} {res} .06615773  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .39691598 {space 3} {res} .06620084  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .39699234 {space 3} {res} .06624029  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .39706243 {space 3} {res} .06627637  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .39712671 {space 3} {res} .06630937  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .39718564 {space 3} {res} .06633953  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .39723963 {space 3} {res}  .0663671  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .39728908 {space 3} {res} .06639228  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .39733433 {space 3} {res} .06641528  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .39737574 {space 3} {res} .06643629  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .39741361 {space 3} {res} .06645547  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .39744823 {space 3} {res} .06647297  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .39747988 {space 3} {res} .06648895  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res}  .3975088 {space 3} {res} .06650353  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .39753522 {space 3} {res} .06651684  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .39755935 {space 3} {res} .06652898  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .39758138 {space 3} {res} .06654005  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res}  .3976015 {space 3} {res} .06655015  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .39761986 {space 3} {res} .06655936  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .39763662 {space 3} {res} .06656776  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .39765191 {space 3} {res} .06657542  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .39766586 {space 3} {res} .06658241  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .39767859 {space 3} {res} .06658878  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res}  .3976902 {space 3} {res} .06659458  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .39770079 {space 3} {res} .06659988  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .39771045 {space 3} {res}  .0666047  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .39771926 {space 3} {res}  .0666091  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .39772729 {space 3} {res} .06661311  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .39773461 {space 3} {res} .06661676  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .39774129 {space 3} {res}  .0666201  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .39774738 {space 3} {res} .06662313  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .39775292 {space 3} {res}  .0666259  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .39775798 {space 3} {res} .06662842  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res}  .3977626 {space 3} {res} .06663072  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res}  .3977668 {space 3} {res} .06663282  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .39777063 {space 3} {res} .06663473  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .39777412 {space 3} {res} .06663647  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .39777731 {space 3} {res} .06663805  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .39778021 {space 3} {res}  .0666395  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .39778285 {space 3} {res} .06664081  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .39778526 {space 3} {res} .06664201  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .39778746 {space 3} {res} .06664311  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .39778946 {space 3} {res}  .0666441  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .39779128 {space 3} {res} .06664501  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .39779294 {space 3} {res} .06664584  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .39779446 {space 3} {res} .06664659  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .39779584 {space 3} {res} .06664728  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res}  .3977971 {space 3} {res} .06664791  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .39779824 {space 3} {res} .06664848  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .39779929 {space 3} {res}   .066649  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .39780024 {space 3} {res} .06664947  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .39780111 {space 3} {res}  .0666499  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.


{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=.3.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .45197417 {space 3} {res}  .0804092  ^
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .44085099 {space 3} {res} .07690935  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .43134576 {space 3} {res} .07372923  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .42304571 {space 3} {res} .07081702  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res}  .4160214 {space 3} {res} .06819127  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .41003996 {space 3} {res} .06582163  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .40496407 {space 3} {res} .06368968  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .40067132 {space 3} {res} .06177706  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .39783451 {space 3} {res} .06011591  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .39626151 {space 3} {res} .05874874  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .39590672 {space 3} {res} .05767039  *
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .39601584 {space 3} {res} .05679456  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .39637069 {space 3} {res} .05610545  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .39763708 {space 3} {res} .05588445  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .39890064 {space 3} {res} .05595617  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .39999881 {space 3} {res} .05623009  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .40053602 {space 3} {res} .05648879  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .40090983 {space 3} {res} .05671148  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .40115198 {space 3} {res} .05713656  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res}  .4010887 {space 3} {res} .05778302  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res}  .4012945 {space 3} {res} .05843892  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .40142979 {space 3} {res} .05903497  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res}  .4014758 {space 3} {res} .05955618  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .40105366 {space 3} {res}  .0599013  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .40029151 {space 3} {res} .06016993  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .39970659 {space 3} {res} .06046138  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .39926895 {space 3} {res}  .0607661  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .39895278 {space 3} {res} .06107651  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .39873604 {space 3} {res}  .0613867  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .39859995 {space 3} {res} .06169214  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res}  .3984858 {space 3} {res}  .0620006  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .39824552 {space 3} {res} .06234451  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .39805634 {space 3} {res} .06266924  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .39790253 {space 3} {res} .06297314  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .39778998 {space 3} {res} .06325961  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .39759263 {space 3} {res} .06350303  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .39751014 {space 3} {res} .06374927  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .39745125 {space 3} {res} .06397937  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .39741135 {space 3} {res}  .0641938  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .39738659 {space 3} {res} .06439313  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .39737379 {space 3} {res} .06457804  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .39737034 {space 3} {res} .06474923  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .39737409 {space 3} {res} .06490748  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .39738331 {space 3} {res} .06505354  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .39739656 {space 3} {res} .06518817  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res}  .3974127 {space 3} {res} .06531214  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .39743082 {space 3} {res} .06542616  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .39745017 {space 3} {res} .06553094  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .39747018 {space 3} {res} .06562714  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .39749041 {space 3} {res} .06571542  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res}  .3975105 {space 3} {res} .06579635  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .39753019 {space 3} {res} .06587052  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .39754929 {space 3} {res} .06593845  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .39756766 {space 3} {res} .06600063  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res}  .3975852 {space 3} {res} .06605753  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .39760185 {space 3} {res} .06610957  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .39761758 {space 3} {res} .06615716  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .39763238 {space 3} {res} .06620065  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .39764625 {space 3} {res}  .0662404  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .39765921 {space 3} {res} .06627671  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .39767128 {space 3} {res} .06630987  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .39768251 {space 3} {res} .06634015  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .39769292 {space 3} {res}  .0663678  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .39770257 {space 3} {res} .06639303  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .39771148 {space 3} {res} .06641606  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .39771971 {space 3} {res} .06643708  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res}  .3977273 {space 3} {res} .06645625  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .39773428 {space 3} {res} .06647374  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .39774071 {space 3} {res}  .0664897  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .39774662 {space 3} {res} .06650425  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .39775204 {space 3} {res} .06651753  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .39775702 {space 3} {res} .06652963  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .39776158 {space 3} {res} .06654067  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .39776576 {space 3} {res} .06655073  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res}  .3977696 {space 3} {res}  .0665599  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res}  .3977731 {space 3} {res} .06656827  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .39777631 {space 3} {res}  .0665759  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .39777925 {space 3} {res} .06658285  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .39778194 {space 3} {res} .06658918  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .39778439 {space 3} {res} .06659496  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .39778663 {space 3} {res} .06660022  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .39778868 {space 3} {res} .06660502  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .39779056 {space 3} {res}  .0666094  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .39779227 {space 3} {res} .06661338  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .39779383 {space 3} {res} .06661702  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .39779525 {space 3} {res} .06662033  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .39779655 {space 3} {res} .06662334  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .39779774 {space 3} {res} .06662609  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .39779882 {space 3} {res}  .0666286  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .39779981 {space 3} {res} .06663088  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .39780071 {space 3} {res} .06663297  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .39780153 {space 3} {res} .06663486  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .39780228 {space 3} {res} .06663659  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .39780296 {space 3} {res} .06663817  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .39780359 {space 3} {res}  .0666396  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .39780416 {space 3} {res} .06664091  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .39780467 {space 3} {res}  .0666421  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .39780515 {space 3} {res} .06664319  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .39780558 {space 3} {res} .06664418  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .39780597 {space 3} {res} .06664508  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.


{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=.7.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .59804873 {space 3} {res} .12206642  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .56625134 {space 3} {res} .11319815  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .53909987 {space 3} {res} .10521207  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .51645722 {space 3} {res} .09836826  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .49798873 {space 3} {res} .09239705  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .48288902 {space 3} {res} .08696001  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .46898652 {space 3} {res} .08223208  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .45625131 {space 3} {res} .07816374  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .44378308 {space 3} {res} .07448935  ^
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .43306436 {space 3} {res} .07120481  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .42400228 {space 3} {res} .06829651  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .41622294 {space 3} {res} .06570924  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .40972053 {space 3} {res} .06342538  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .40456349 {space 3} {res} .06133936  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .40019069 {space 3} {res} .05953338  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .39656268 {space 3} {res} .05794383  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .39456781 {space 3} {res} .05663335  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .39393967 {space 3} {res} .05567264  *
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .39446129 {space 3} {res} .05501914  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .39539674 {space 3} {res} .05456743  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .39645147 {space 3} {res} .05430218  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .39850191 {space 3} {res} .05457168  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .40031908 {space 3} {res} .05507574  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res}  .4017285 {space 3} {res} .05573578  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .40273929 {space 3} {res} .05630224  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .40352456 {space 3} {res} .05681872  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .40382509 {space 3} {res} .05752624  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .40394459 {space 3} {res} .05833314  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .40419369 {space 3} {res} .05909249  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .40438019 {space 3} {res} .05970086  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .40433062 {space 3} {res} .06014873  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .40361461 {space 3} {res} .06038594  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .40279319 {space 3} {res} .06069778  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .40216628 {space 3} {res} .06101827  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .40167892 {space 3} {res} .06133808  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .40127954 {space 3} {res} .06165855  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .40095657 {space 3} {res}  .0619733  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .40071745 {space 3} {res} .06227335  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .40039246 {space 3} {res} .06259593  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .40004458 {space 3} {res} .06292134  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .39975736 {space 3} {res} .06322567  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res}  .3995205 {space 3} {res} .06350932  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res}  .3993254 {space 3} {res} .06377298  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .39916492 {space 3} {res} .06401746  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .39901529 {space 3} {res}  .0642402  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res}  .3988884 {space 3} {res}  .0644457  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .39867525 {space 3} {res} .06461561  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .39855599 {space 3} {res} .06478545  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .39845445 {space 3} {res} .06494218  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .39836787 {space 3} {res} .06508662  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .39829393 {space 3} {res} .06521957  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .39823066 {space 3} {res} .06534181  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .39817644 {space 3} {res} .06545411  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .39812988 {space 3} {res} .06555717  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .39808982 {space 3} {res}  .0656517  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .39805529 {space 3} {res} .06573834  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .39802546 {space 3} {res}  .0658177  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .39799964 {space 3} {res} .06589036  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .39797724 {space 3} {res} .06595685  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .39795777 {space 3} {res} .06601767  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .39794082 {space 3} {res} .06607328  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .39792601 {space 3} {res} .06612412  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .39791306 {space 3} {res} .06617057  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .39790171 {space 3} {res} .06621301  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .39789174 {space 3} {res} .06625177  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .39788297 {space 3} {res} .06628716  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .39787523 {space 3} {res} .06631948  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .39786839 {space 3} {res} .06634897  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .39786234 {space 3} {res} .06637589  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .39785697 {space 3} {res} .06640045  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res}  .3978522 {space 3} {res} .06642286  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .39784795 {space 3} {res}  .0664433  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .39784417 {space 3} {res} .06646195  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .39784079 {space 3} {res} .06647896  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .39783777 {space 3} {res} .06649447  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .39783507 {space 3} {res} .06650861  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .39783265 {space 3} {res} .06652151  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .39783047 {space 3} {res} .06653327  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .39782852 {space 3} {res} .06654399  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .39782676 {space 3} {res} .06655377  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .39782518 {space 3} {res} .06656268  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .39782376 {space 3} {res}  .0665708  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .39782247 {space 3} {res} .06657821  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .39782131 {space 3} {res} .06658496  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .39782026 {space 3} {res} .06659111  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .39781931 {space 3} {res} .06659672  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .39781846 {space 3} {res} .06660183  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .39781768 {space 3} {res} .06660648  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .39781698 {space 3} {res} .06661073  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .39781634 {space 3} {res}  .0666146  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .39781576 {space 3} {res} .06661813  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .39781524 {space 3} {res} .06662134  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .39781477 {space 3} {res} .06662427  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .39781433 {space 3} {res} .06662694  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .39781394 {space 3} {res} .06662937  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .39781359 {space 3} {res} .06663158  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .39781327 {space 3} {res}  .0666336  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .39781297 {space 3} {res} .06663544  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .39781271 {space 3} {res} .06663712  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .39781246 {space 3} {res} .06663865  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}


K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .71509992 {space 3} {res} .13557667  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .69211629 {space 3} {res} .13736796  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .65912234 {space 3} {res} .13753928  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .61914297 {space 3} {res}  .1293188  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .58076451 {space 3} {res} .11850258  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .54884065 {space 3} {res} .10899495  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .52228097 {space 3} {res} .10063833  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .50059369 {space 3} {res} .09358173  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .48326941 {space 3} {res} .08784782  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .46935768 {space 3} {res} .08265231  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .45784905 {space 3} {res} .07813885  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .44700466 {space 3} {res} .07431458  ^
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .43734357 {space 3} {res} .07082821  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .42782684 {space 3} {res} .06780403  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .41964342 {space 3} {res} .06521807  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .41287659 {space 3} {res} .06295527  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .40704279 {space 3} {res} .06094835  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .40212896 {space 3} {res} .05917828  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .39803326 {space 3} {res} .05763309  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .39522252 {space 3} {res} .05625254  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .39390033 {space 3} {res} .05519467  *
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .39411578 {space 3} {res} .05453726  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res}  .3950586 {space 3} {res} .05410577  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .39617939 {space 3} {res} .05386855  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .39798687 {space 3} {res} .05395513  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .39998435 {space 3} {res} .05451094  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .40184089 {space 3} {res} .05521393  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .40322108 {space 3} {res} .05600806  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .40390511 {space 3} {res} .05658052  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .40463645 {space 3} {res} .05723751  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .40477753 {space 3} {res} .05807889  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .40498712 {space 3} {res} .05889816  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .40523215 {space 3} {res} .05961567  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .40536601 {space 3} {res} .06017162  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .40478782 {space 3} {res} .06039114  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .40398644 {space 3} {res} .06069388  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res}   .403247 {space 3} {res} .06102068  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res}  .4026492 {space 3} {res} .06134492  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .40217933 {space 3} {res} .06166271  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .40180796 {space 3} {res}  .0619716  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .40149375 {space 3} {res} .06227436  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .40119581 {space 3} {res} .06257533  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res}  .4007705 {space 3} {res} .06290603  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .40041431 {space 3} {res} .06321472  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res}  .4001158 {space 3} {res} .06350196  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res}  .3998654 {space 3} {res} .06376851  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .39965519 {space 3} {res}  .0640153  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .39947855 {space 3} {res} .06424336  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .39931853 {space 3} {res} .06445159  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .39917376 {space 3} {res} .06464183  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .39895253 {space 3} {res}  .0647995  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .39881483 {space 3} {res} .06495549  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res}  .3986955 {space 3} {res} .06509918  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .39859189 {space 3} {res} .06523138  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .39850171 {space 3} {res} .06535289  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .39842306 {space 3} {res} .06546447  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .39835432 {space 3} {res} .06556685  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .39829411 {space 3} {res} .06566071  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .39824126 {space 3} {res} .06574671  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .39819478 {space 3} {res} .06582547  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .39815381 {space 3} {res} .06589755  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .39811764 {space 3} {res}  .0659635  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .39808563 {space 3} {res} .06602382  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .39805726 {space 3} {res} .06607895  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .39803208 {space 3} {res} .06612934  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .39800967 {space 3} {res} .06617538  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .39798971 {space 3} {res} .06621743  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res}  .3979719 {space 3} {res} .06625583  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .39795599 {space 3} {res}  .0662909  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .39794175 {space 3} {res}  .0663229  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .39792899 {space 3} {res} .06635211  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .39791755 {space 3} {res} .06637876  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .39790726 {space 3} {res} .06640308  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .39789802 {space 3} {res} .06642527  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res}  .3978897 {space 3} {res} .06644551  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res}  .3978822 {space 3} {res} .06646397  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .39787545 {space 3} {res}  .0664808  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .39786934 {space 3} {res} .06649616  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .39786384 {space 3} {res} .06651015  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .39785886 {space 3} {res} .06652292  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .39785435 {space 3} {res} .06653456  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .39785028 {space 3} {res} .06654517  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .39784659 {space 3} {res} .06655484  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .39784324 {space 3} {res} .06656366  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .39784021 {space 3} {res}  .0665717  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .39783746 {space 3} {res} .06657902  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .39783497 {space 3} {res}  .0665857  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .39783271 {space 3} {res} .06659179  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .39783065 {space 3} {res} .06659734  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .39782879 {space 3} {res} .06660239  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res}  .3978271 {space 3} {res}   .066607  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .39782556 {space 3} {res}  .0666112  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .39782416 {space 3} {res} .06661503  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .39782289 {space 3} {res} .06661852  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .39782173 {space 3} {res} .06662169  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .39782068 {space 3} {res} .06662459  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .39781972 {space 3} {res} .06662723  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .39781885 {space 3} {res} .06662964  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .39781806 {space 3} {res} .06663183  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .39781734 {space 3} {res} .06663383  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}

Cross-validation over alpha (0 .3 .7 1).
{col 10}alpha {c |} lopt*{col 30} Minimum MSPE
{col 4}{hline 12}{c +}{hline 28}
{res}{col 10}0.000{txt}{col 16}{c |}{res}{col 17} 16.067278{col 30} .38933388{txt}{col 42}#
{res}{col 10}0.300{txt}{col 16}{c |}{res}{col 17} 25.583651{col 30} .39590672
{col 10}0.700{txt}{col 16}{c |}{res}{col 17} 13.339337{col 30} .39393967
{col 10}1.000{txt}{col 16}{c |}{res}{col 17} 10.090719{col 30} .39390033
{txt}* lambda value that minimizes MSPE for a given alpha
# alpha value that minimizes MSPE
Estimate lasso with lambda=64.864 (lse) and alpha=0.

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2321985      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.5274469      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0052194     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0804794      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.1159764     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0018973     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1439188      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020957      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.8073752     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=64.86388040195).
(69 missing values generated)

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2321985      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.5274469      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0052194     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0804794      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.1159764     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0018973     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1439188      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020957      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.8073752     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=64.86388040195).
(69 missing values generated)
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .23219855    .5274469  -.00521937   .08047941  -.11597644    .0018973

{txt}       gleason       pgg45       _cons
y1 {res}  .14391884    .0020957  -.80737524
{reset}{res}
{txt}__000001[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .23219855    .5274469  -.00521937   .08047941  -.11597644    .0018973

{txt}       gleason       pgg45       _cons
y1 {res}  .14391884    .0020957  -.80737524
{reset}
K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res}    .73815 {space 3} {res} .13934819  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .72696279 {space 3} {res} .13684858  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res}  .6911905 {space 3} {res} .13033704  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .65516965 {space 3} {res} .12292271  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .61856766 {space 3} {res} .11453878  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res}    .58831 {space 3} {res}  .1077572  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .56330798 {space 3} {res} .10240623  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .54289378 {space 3} {res} .09839534  ^
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .52636626 {space 3} {res}  .0955039  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .51313142 {space 3} {res} .09344308  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .50234616 {space 3} {res} .09222386  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .49347152 {space 3} {res}  .0916299  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .48604068 {space 3} {res}  .0914002  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .47998464 {space 3} {res} .09145944  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .47423991 {space 3} {res}  .0914453  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .46906988 {space 3} {res} .09158127  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .46489735 {space 3} {res} .09190217  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res}  .4614885 {space 3} {res} .09233757  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .45850261 {space 3} {res} .09279684  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res}  .4561127 {space 3} {res} .09333192  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .45422707 {space 3} {res} .09391417  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .45408009 {space 3} {res} .09444503  *
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .45520803 {space 3} {res}  .0947816  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .45659624 {space 3} {res} .09510214  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .45813535 {space 3} {res} .09541936  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .45930426 {space 3} {res} .09575555  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .45997826 {space 3} {res}  .0960196  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .46072422 {space 3} {res} .09626595  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .46123203 {space 3} {res} .09614638  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .46142682 {space 3} {res} .09580863  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res}  .4610857 {space 3} {res} .09543152  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .46083084 {space 3} {res} .09510119  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .46052499 {space 3} {res} .09465709  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .45998373 {space 3} {res} .09434707  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .45951242 {space 3} {res} .09412049  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .45892324 {space 3} {res} .09398604  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .45831124 {space 3} {res} .09388383  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .45780819 {space 3} {res} .09380499  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .45735658 {space 3} {res} .09376111  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .45700626 {space 3} {res} .09372764  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .45673819 {space 3} {res}  .0937025  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .45646934 {space 3} {res} .09362726  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .45609866 {space 3} {res} .09342596  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .45579166 {space 3} {res} .09324682  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .45553748 {space 3} {res} .09308717  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .45532708 {space 3} {res} .09294468  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .45515297 {space 3} {res} .09281735  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .45500894 {space 3} {res} .09270341  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .45488984 {space 3} {res} .09260133  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .45479139 {space 3} {res} .09250976  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .45471005 {space 3} {res} .09242754  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .45464287 {space 3} {res} .09235363  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .45458743 {space 3} {res} .09228712  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res}  .4545417 {space 3} {res} .09222722  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res}   .454504 {space 3} {res} .09217322  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .45447295 {space 3} {res} .09212451  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res}  .4544474 {space 3} {res} .09208052  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .45442639 {space 3} {res} .09204078  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .45440914 {space 3} {res} .09200485  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .45439498 {space 3} {res} .09197234  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .45438338 {space 3} {res} .09194291  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res}  .4543739 {space 3} {res} .09191626  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .45436615 {space 3} {res} .09189211  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .45435983 {space 3} {res} .09187021  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res}  .4543547 {space 3} {res} .09185035  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .45435053 {space 3} {res} .09183234  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .45434716 {space 3} {res} .09181598  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .45434444 {space 3} {res} .09180114  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .45434226 {space 3} {res} .09178765  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .45434041 {space 3} {res} .09177539  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .45433094 {space 3} {res} .09176357  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .45432292 {space 3} {res} .09175286  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .45431575 {space 3} {res} .09174312  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .45430934 {space 3} {res} .09173428  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .45430359 {space 3} {res} .09172623  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .45429844 {space 3} {res} .09171891  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .45429381 {space 3} {res} .09171226  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .45428965 {space 3} {res}  .0917062  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .45428591 {space 3} {res} .09170069  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .45428253 {space 3} {res} .09169568  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .45427949 {space 3} {res} .09169112  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .45427675 {space 3} {res} .09168697  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .45427427 {space 3} {res} .09168319  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .45427203 {space 3} {res} .09167975  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .45427001 {space 3} {res} .09167661  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .45426817 {space 3} {res} .09167376  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .45426651 {space 3} {res} .09167116  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .45426501 {space 3} {res}  .0916688  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .45426365 {space 3} {res} .09166665  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .45426241 {space 3} {res} .09166468  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .45426129 {space 3} {res}  .0916629  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .45426028 {space 3} {res} .09166127  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .45425935 {space 3} {res} .09165979  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .45425851 {space 3} {res} .09165844  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .45425775 {space 3} {res} .09165721  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .45425706 {space 3} {res} .09165609  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .45425643 {space 3} {res} .09165507  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .45425586 {space 3} {res} .09165414  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .45425534 {space 3} {res}  .0916533  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .45425487 {space 3} {res} .09165253  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
Estimate lasso with lambda=33.82 (lse).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.1848622      0.3782994
{txt}{space 10}lweight {c |}{col 21}{res}      0.3581076      0.8391637
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}      0.5029428     -1.3919237
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=33.82008100076).
(69 missing values generated)

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.1848622      0.3782994
{txt}{space 10}lweight {c |}{col 21}{res}      0.3581076      0.8391637
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}      0.5029428     -1.3919237
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=33.82008100076).
(69 missing values generated)
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,3]
       lcavol    lweight      _cons
y1 {res} .18486224  .35810765  .50294277
{reset}{res}
{txt}__000001[1,3]
       lcavol    lweight      _cons
y1 {res} .18486224  .35810765  .50294277
{reset}
K-fold cross-validation with 10 folds. Elastic net with alpha=0.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .44281108 {space 3} {res} .06901627  ^
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .44157074 {space 3} {res} .06892982  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .44058439 {space 3} {res} .06896985  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .43984218 {space 3} {res} .06912572  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .43933246 {space 3} {res} .06938615  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .43904189 {space 3} {res} .06973945  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res}  .4389556 {space 3} {res} .07017382  *
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .43905742 {space 3} {res} .07067749  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res}  .4393302 {space 3} {res} .07123901  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .43975607 {space 3} {res} .07184736  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .44031679 {space 3} {res} .07249211  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res}  .4409941 {space 3} {res} .07316354  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .44176997 {space 3} {res} .07385275  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .44262695 {space 3} {res} .07455164  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .44354837 {space 3} {res} .07525299  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .44451854 {space 3} {res} .07595047  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .44552298 {space 3} {res} .07663858  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .44654843 {space 3} {res} .07731267  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .44758303 {space 3} {res} .07796884  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .44861627 {space 3} {res} .07860396  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .44963903 {space 3} {res} .07921553  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .45064352 {space 3} {res} .07980168  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .45162323 {space 3} {res} .08036108  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .45257288 {space 3} {res} .08089289  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .45348826 {space 3} {res} .08139667  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .45436619 {space 3} {res} .08187234  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .45520438 {space 3} {res} .08232015  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .45600135 {space 3} {res} .08274057  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res}  .4567563 {space 3} {res} .08313428  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .45746901 {space 3} {res} .08350213  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .45813975 {space 3} {res}  .0838451  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .45876924 {space 3} {res} .08416425  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .45935847 {space 3} {res} .08446071  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .45990873 {space 3} {res} .08473563  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res}  .4604215 {space 3} {res}  .0849902  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .46089839 {space 3} {res}  .0852256  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .46134112 {space 3} {res}   .085443  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .46175147 {space 3} {res} .08564354  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .46213123 {space 3} {res} .08582834  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .46248222 {space 3} {res} .08599846  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res}  .4628062 {space 3} {res} .08615493  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .46310491 {space 3} {res} .08629874  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .46338005 {space 3} {res}  .0864308  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .46363322 {space 3} {res} .08655199  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .46386598 {space 3} {res} .08666314  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .46407981 {space 3} {res} .08676503  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .46427611 {space 3} {res} .08685837  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .46445619 {space 3} {res} .08694384  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .46462129 {space 3} {res} .08702207  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .46477259 {space 3} {res} .08709365  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .46491115 {space 3} {res} .08715911  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res}   .465038 {space 3} {res} .08721897  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .46515409 {space 3} {res} .08727367  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .46526027 {space 3} {res} .08732367  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .46535737 {space 3} {res} .08736934  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .46544613 {space 3} {res} .08741105  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .46552724 {space 3} {res} .08744914  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .46560135 {space 3} {res} .08748391  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .46566904 {space 3} {res} .08751565  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .46573086 {space 3} {res} .08754462  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res}  .4657873 {space 3} {res} .08757106  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .46583882 {space 3} {res} .08759518  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .46588584 {space 3} {res} .08761718  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .46592876 {space 3} {res} .08763725  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .46596791 {space 3} {res} .08765556  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .46600364 {space 3} {res} .08767226  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .46603623 {space 3} {res} .08768749  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .46606595 {space 3} {res} .08770137  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .46609306 {space 3} {res} .08771403  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .46611779 {space 3} {res} .08772558  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .46614033 {space 3} {res}  .0877361  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .46616089 {space 3} {res}  .0877457  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .46617964 {space 3} {res} .08775444  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .46619673 {space 3} {res} .08776242  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .46621231 {space 3} {res} .08776968  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .46622651 {space 3} {res} .08777631  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .46623946 {space 3} {res} .08778235  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .46625126 {space 3} {res} .08778785  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .46626202 {space 3} {res} .08779287  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .46627183 {space 3} {res} .08779744  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .46628076 {space 3} {res}  .0878016  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .46628891 {space 3} {res}  .0878054  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .46629633 {space 3} {res} .08780886  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res}  .4663031 {space 3} {res} .08781201  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .46630927 {space 3} {res} .08781489  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .46631489 {space 3} {res} .08781751  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .46632001 {space 3} {res} .08781989  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .46632468 {space 3} {res} .08782207  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .46632893 {space 3} {res} .08782405  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res}  .4663328 {space 3} {res} .08782586  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .46633634 {space 3} {res}  .0878275  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .46633956 {space 3} {res}   .087829  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .46634249 {space 3} {res} .08783037  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .46634516 {space 3} {res} .08783161  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res}  .4663476 {space 3} {res} .08783275  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .46634982 {space 3} {res} .08783378  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .46635184 {space 3} {res} .08783472  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .46635368 {space 3} {res} .08783558  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .46635536 {space 3} {res} .08783637  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .46635689 {space 3} {res} .08783708  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.


{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=.3.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .48700097 {space 3} {res} .08681793  ^
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .47747024 {space 3} {res} .08247135  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .46951275 {space 3} {res} .07867719  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .46289554 {space 3} {res} .07539951  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .45729711 {space 3} {res} .07265127  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .45277127 {space 3} {res}  .0703662  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .44909783 {space 3} {res} .06852763  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .44615262 {space 3} {res} .06709731  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .44444165 {space 3} {res} .06620883  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .44349427 {space 3} {res} .06570267  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .44292313 {space 3} {res}  .0654398  *
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .44302772 {space 3} {res}  .0653831  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .44367693 {space 3} {res} .06559109  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .44447423 {space 3} {res} .06611789  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .44530459 {space 3} {res} .06678324  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .44630467 {space 3} {res} .06752289  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res}  .4466282 {space 3} {res} .06817245  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .44695289 {space 3} {res} .06875543  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .44824079 {space 3} {res} .06971831  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .44961458 {space 3} {res} .07076419  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .45086442 {space 3} {res} .07196261  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .45140866 {space 3} {res} .07278994  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .45185913 {space 3} {res} .07362847  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .45227101 {space 3} {res} .07454284  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .45272875 {space 3} {res} .07546856  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .45328027 {space 3} {res} .07636154  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .45389935 {space 3} {res} .07721672  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .45456416 {space 3} {res} .07803072  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .45525664 {space 3} {res} .07880156  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .45596207 {space 3} {res} .07952832  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .45666859 {space 3} {res} .08021092  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res}  .4573668 {space 3} {res} .08084994  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .45804938 {space 3} {res} .08144644  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .45871075 {space 3} {res} .08200185  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .45934684 {space 3} {res} .08251786  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .45995475 {space 3} {res} .08299632  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .46050826 {space 3} {res} .08343091  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .46092949 {space 3} {res} .08379732  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .46132941 {space 3} {res} .08413545  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .46170737 {space 3} {res} .08444712  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .46206317 {space 3} {res} .08473407  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .46239695 {space 3} {res} .08499801  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .46270912 {space 3} {res} .08524057  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .46300031 {space 3} {res} .08546332  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .46327129 {space 3} {res} .08566771  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .46352292 {space 3} {res} .08585514  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .46375616 {space 3} {res} .08602692  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .46397199 {space 3} {res} .08618427  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .46417141 {space 3} {res} .08632834  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .46435542 {space 3} {res} .08646018  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .46452501 {space 3} {res} .08658078  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .46468114 {space 3} {res} .08669108  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .46482474 {space 3} {res}  .0867919  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res}  .4649567 {space 3} {res} .08688404  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .46507787 {space 3} {res} .08696823  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .46518905 {space 3} {res} .08704513  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res}   .465291 {space 3} {res} .08711535  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .46538443 {space 3} {res} .08717947  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .46547001 {space 3} {res} .08723801  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .46554836 {space 3} {res} .08729143  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .46562005 {space 3} {res} .08734018  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .46568564 {space 3} {res} .08738467  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .46574561 {space 3} {res} .08742525  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .46580043 {space 3} {res} .08746227  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .46585053 {space 3} {res} .08749604  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .46589631 {space 3} {res} .08752684  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .46593812 {space 3} {res} .08755493  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res}  .4659763 {space 3} {res} .08758054  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .46601115 {space 3} {res}  .0876039  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .46604297 {space 3} {res} .08762519  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .46607202 {space 3} {res} .08764461  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .46609852 {space 3} {res} .08766231  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res}  .4661227 {space 3} {res} .08767844  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .46614476 {space 3} {res} .08769315  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .46616489 {space 3} {res} .08770656  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .46618325 {space 3} {res} .08771878  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .46619999 {space 3} {res} .08772992  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .46621526 {space 3} {res} .08774008  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .46622918 {space 3} {res} .08774933  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .46624188 {space 3} {res} .08775776  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .46625345 {space 3} {res} .08776545  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res}   .466264 {space 3} {res} .08777246  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .46627362 {space 3} {res} .08777884  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .46628239 {space 3} {res} .08778466  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .46629039 {space 3} {res} .08778996  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .46629768 {space 3} {res} .08779479  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .46630432 {space 3} {res}  .0877992  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .46631037 {space 3} {res} .08780321  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .46631589 {space 3} {res} .08780686  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .46632092 {space 3} {res}  .0878102  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .46632551 {space 3} {res} .08781323  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .46632968 {space 3} {res}   .087816  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .46633349 {space 3} {res} .08781852  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .46633696 {space 3} {res} .08782082  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .46634012 {space 3} {res} .08782291  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .46634301 {space 3} {res} .08782482  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .46634563 {space 3} {res} .08782656  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .46634803 {space 3} {res} .08782814  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .46635021 {space 3} {res} .08782958  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .46635219 {space 3} {res}  .0878309  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.


{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=.7.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .61908325 {space 3} {res} .14007728  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .58768457 {space 3} {res} .12895516  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .56180475 {space 3} {res} .11880805  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .54022603 {space 3} {res} .10995919  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .52385289 {space 3} {res}  .1025955  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .51089075 {space 3} {res} .09596056  ^
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .49980854 {space 3} {res} .09023074  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .49045501 {space 3} {res} .08524215  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .48198502 {space 3} {res} .08106536  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .47464126 {space 3} {res}  .0776364  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .46874879 {space 3} {res} .07480098  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .46373077 {space 3} {res} .07227668  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .45976766 {space 3} {res} .07031213  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .45667062 {space 3} {res} .06883941  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .45399967 {space 3} {res} .06771037  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .45142364 {space 3} {res} .06680078  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .44963884 {space 3} {res} .06625339  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .44879453 {space 3} {res} .06607441  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .44835159 {space 3} {res} .06609829  *
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .44867726 {space 3} {res} .06631856  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .44965465 {space 3} {res} .06684646  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .45060616 {space 3} {res} .06761852  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .45150574 {space 3} {res} .06845715  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .45270365 {space 3} {res}  .0694032  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .45267636 {space 3} {res}  .0700133  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res}  .4525081 {space 3} {res} .07052514  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .45329734 {space 3} {res} .07140489  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .45448018 {space 3} {res} .07262912  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res}  .4554019 {space 3} {res} .07376223  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .45592571 {space 3} {res} .07462943  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .45658036 {space 3} {res} .07547675  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .45706861 {space 3} {res} .07636434  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .45755354 {space 3} {res} .07725066  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .45793029 {space 3} {res} .07806272  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .45824796 {space 3} {res} .07888572  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .45868108 {space 3} {res} .07963897  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .45914542 {space 3} {res} .08034165  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .45962684 {space 3} {res} .08099518  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .46011428 {space 3} {res} .08160143  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .46059918 {space 3} {res} .08216261  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .46107507 {space 3} {res} .08268111  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res}  .4615371 {space 3} {res} .08315941  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .46198182 {space 3} {res} .08360002  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .46240681 {space 3} {res} .08400541  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .46275325 {space 3} {res} .08435814  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .46300833 {space 3} {res} .08465632  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res}  .4632519 {space 3} {res} .08493001  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .46348313 {space 3} {res} .08518104  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .46370156 {space 3} {res} .08541113  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .46390702 {space 3} {res}  .0856219  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res}  .4640996 {space 3} {res} .08581488  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .46427952 {space 3} {res} .08599148  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .46444718 {space 3} {res} .08615302  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .46460303 {space 3} {res} .08630074  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res}  .4647476 {space 3} {res} .08643578  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .46488146 {space 3} {res} .08655917  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res}  .4650052 {space 3} {res} .08667191  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .46511943 {space 3} {res} .08677487  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .46522473 {space 3} {res} .08686889  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res}  .4653217 {space 3} {res} .08695473  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res}  .4654109 {space 3} {res} .08703308  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .46549288 {space 3} {res} .08710459  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .46556817 {space 3} {res} .08716984  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .46563725 {space 3} {res} .08722938  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .46570059 {space 3} {res} .08728369  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .46575865 {space 3} {res} .08733324  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .46581182 {space 3} {res} .08737842  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .46586051 {space 3} {res} .08741963  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .46590506 {space 3} {res} .08745721  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .46594581 {space 3} {res} .08749148  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .46598308 {space 3} {res} .08752273  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .46601714 {space 3} {res} .08755122  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .46604827 {space 3} {res} .08757719  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .46607671 {space 3} {res} .08760087  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .46610269 {space 3} {res} .08762245  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .46612641 {space 3} {res} .08764213  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .46614806 {space 3} {res} .08766006  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .46616783 {space 3} {res} .08767641  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .46618588 {space 3} {res} .08769131  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .46620234 {space 3} {res} .08770489  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .46621737 {space 3} {res} .08771726  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .46623107 {space 3} {res} .08772854  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .46624357 {space 3} {res} .08773882  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .46625498 {space 3} {res} .08774819  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .46626538 {space 3} {res} .08775673  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .46627486 {space 3} {res} .08776451  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .46628351 {space 3} {res}  .0877716  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res}  .4662914 {space 3} {res} .08777806  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .46629859 {space 3} {res} .08778395  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .46630514 {space 3} {res} .08778932  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .46631112 {space 3} {res} .08779421  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .46631657 {space 3} {res} .08779866  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .46632153 {space 3} {res} .08780272  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .46632606 {space 3} {res} .08780642  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .46633018 {space 3} {res}  .0878098  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .46633395 {space 3} {res} .08781287  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .46633737 {space 3} {res} .08781567  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res}  .4663405 {space 3} {res} .08781822  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .46634335 {space 3} {res} .08782054  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .46634594 {space 3} {res} .08782266  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}


K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .71826991 {space 3} {res} .15027898  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res}  .7017569 {space 3} {res} .15174323  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res}  .6734222 {space 3} {res} .15141824  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .64310127 {space 3} {res} .14976061  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .60479302 {space 3} {res} .13626295  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .57281759 {space 3} {res} .12432963  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .54743119 {space 3} {res} .11368317  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res}    .52676 {space 3} {res}  .1044928  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .51117725 {space 3} {res} .09740443  ^
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .49959732 {space 3} {res} .09110491  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res}  .4904423 {space 3} {res} .08570847  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .48294823 {space 3} {res} .08119264  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .47649033 {space 3} {res}  .0773659  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .47093259 {space 3} {res} .07441875  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .46587429 {space 3} {res} .07212743  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .46191477 {space 3} {res} .07037382  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .45850018 {space 3} {res} .06884241  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .45587172 {space 3} {res} .06776415  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .45387051 {space 3} {res} .06705988  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .45237398 {space 3} {res} .06666243  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .45155286 {space 3} {res}  .0665075  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .45104001 {space 3} {res} .06653322  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .45082081 {space 3} {res} .06666169  *
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res}  .4515464 {space 3} {res} .06702063  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .45235585 {space 3} {res} .06774026  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .45329014 {space 3} {res} .06856772  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .45432248 {space 3} {res} .06951011  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .45514309 {space 3} {res} .07040594  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .45458938 {space 3} {res} .07087588  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .45444132 {space 3} {res} .07141817  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .45546838 {space 3} {res} .07252397  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .45657184 {space 3} {res} .07379852  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .45705609 {space 3} {res} .07471615  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res}  .4575917 {space 3} {res} .07556721  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .45811726 {space 3} {res} .07643671  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .45857126 {space 3} {res} .07729199  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res}  .4590032 {space 3} {res} .07813456  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .45939043 {space 3} {res} .07891487  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .45966979 {space 3} {res} .07968782  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .46003744 {space 3} {res} .08039613  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .46043375 {space 3} {res} .08105344  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .46084577 {space 3} {res} .08166195  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .46126345 {space 3} {res} .08222411  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .46167911 {space 3} {res} .08274256  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .46208698 {space 3} {res} .08321999  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .46248281 {space 3} {res} .08365911  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .46286355 {space 3} {res} .08406253  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .46322714 {space 3} {res} .08443283  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .46344987 {space 3} {res} .08472977  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .46365402 {space 3} {res} .08499849  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .46384945 {space 3} {res} .08524474  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .46403534 {space 3} {res} .08547027  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .46421122 {space 3} {res} .08567671  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .46437686 {space 3} {res} .08586559  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .46453227 {space 3} {res} .08603833  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .46467758 {space 3} {res} .08619625  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .46481307 {space 3} {res} .08634058  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .46493909 {space 3} {res} .08647245  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .46505604 {space 3} {res} .08659291  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .46516436 {space 3} {res}  .0867029  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .46526453 {space 3} {res} .08680333  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .46535702 {space 3} {res} .08689501  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res}  .4654423 {space 3} {res} .08697868  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .46552084 {space 3} {res} .08705503  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res}  .4655931 {space 3} {res} .08712469  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .46565952 {space 3} {res} .08718825  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .46572052 {space 3} {res} .08724622  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res}  .4657765 {space 3} {res}  .0872991  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .46582784 {space 3} {res} .08734732  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .46587489 {space 3} {res}  .0873913  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .46591799 {space 3} {res}  .0874314  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .46595745 {space 3} {res} .08746797  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .46599356 {space 3} {res} .08750131  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .46602659 {space 3} {res}  .0875317  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res}  .4660568 {space 3} {res} .08755941  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .46608441 {space 3} {res} .08758467  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .46610965 {space 3} {res} .08760769  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .46613271 {space 3} {res} .08762868  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .46615376 {space 3} {res} .08764781  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res}   .466173 {space 3} {res} .08766524  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .46619055 {space 3} {res} .08768113  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .46620658 {space 3} {res} .08769562  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .46622121 {space 3} {res} .08770882  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .46623456 {space 3} {res} .08772085  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .46624674 {space 3} {res} .08773181  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .46625785 {space 3} {res} .08774181  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .46626799 {space 3} {res} .08775091  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .46627723 {space 3} {res} .08775921  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .46628566 {space 3} {res} .08776677  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .46629335 {space 3} {res} .08777366  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .46630037 {space 3} {res} .08777994  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .46630676 {space 3} {res} .08778566  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .46631259 {space 3} {res} .08779088  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res}  .4663179 {space 3} {res} .08779563  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .46632275 {space 3} {res} .08779996  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .46632717 {space 3} {res} .08780391  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .46633119 {space 3} {res}  .0878075  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .46633486 {space 3} {res} .08781078  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .46633821 {space 3} {res} .08781376  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .46634126 {space 3} {res} .08781648  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}

Cross-validation over alpha (0 .3 .7 1).
{col 10}alpha {c |} lopt*{col 30} Minimum MSPE
{col 4}{hline 12}{c +}{hline 28}
{res}{col 10}0.000{txt}{col 16}{c |}{res}{col 17} 37.117497{col 30}  .4389556{txt}{col 42}#
{res}{col 10}0.300{txt}{col 16}{c |}{res}{col 17} 25.583651{col 30} .44292313
{col 10}0.700{txt}{col 16}{c |}{res}{col 17} 12.154307{col 30} .44835159
{col 10}1.000{txt}{col 16}{c |}{res}{col 17} 8.3774923{col 30} .45082081
{txt}* lambda value that minimizes MSPE for a given alpha
# alpha value that minimizes MSPE
Estimate lasso with lambda=64.864 (lse) and alpha=0.

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2321985      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.5274469      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0052194     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0804794      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.1159764     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0018973     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1439188      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020957      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.8073752     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=64.86388040195).
(69 missing values generated)

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2321985      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.5274469      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0052194     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0804794      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.1159764     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0018973     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1439188      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020957      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.8073752     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=64.86388040195).
(69 missing values generated)
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .23219855    .5274469  -.00521937   .08047941  -.11597644    .0018973

{txt}       gleason       pgg45       _cons
y1 {res}  .14391884    .0020957  -.80737524
{reset}{res}
{txt}__000001[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .23219855    .5274469  -.00521937   .08047941  -.11597644    .0018973

{txt}       gleason       pgg45       _cons
y1 {res}  .14391884    .0020957  -.80737524
{reset}r; t=9.16 9:08:42

{com}. *
. 
. ********************************************************************************
. *** partial                                                                                      ***
. ********************************************************************************
. 
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 9:08:42

{com}. 
. cvlasso $model, partial(svi) saveest(m)

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 113.54767 {space 3} {res} .92810044 {space 3} {res} .14125823  
{txt}         2{c |} {space 3} {res} 103.46041 {space 3} {res} .89743208 {space 3} {res} .13984793  
{txt}         3{c |} {space 3} {res} 94.269272 {space 3} {res} .84698786 {space 3} {res} .12962102  
{txt}         4{c |} {space 3} {res} 85.894649 {space 3} {res}  .8034353 {space 3} {res} .12009755  
{txt}         5{c |} {space 3} {res} 78.264005 {space 3} {res} .76717895 {space 3} {res} .11193551  
{txt}         6{c |} {space 3} {res} 71.311247 {space 3} {res} .73687106 {space 3} {res} .10496926  
{txt}         7{c |} {space 3} {res} 64.976152 {space 3} {res} .70977163 {space 3} {res} .09887212  
{txt}         8{c |} {space 3} {res}  59.20385 {space 3} {res} .68491422 {space 3} {res} .09353112  
{txt}         9{c |} {space 3} {res} 53.944343 {space 3} {res} .66029017 {space 3} {res} .08846888  
{txt}        10{c |} {space 3} {res} 49.152076 {space 3} {res} .63675856 {space 3} {res} .08373702  
{txt}        11{c |} {space 3} {res} 44.785541 {space 3} {res}  .6171784 {space 3} {res} .07978601  
{txt}        12{c |} {space 3} {res} 40.806917 {space 3} {res} .60088269 {space 3} {res} .07648243  ^
{txt}        13{c |} {space 3} {res} 37.181743 {space 3} {res}  .5875348 {space 3} {res} .07382533  
{txt}        14{c |} {space 3} {res}  33.87862 {space 3} {res} .57693934 {space 3} {res} .07171871  
{txt}        15{c |} {space 3} {res} 30.868936 {space 3} {res}  .5682703 {space 3} {res} .07000492  
{txt}        16{c |} {space 3} {res} 28.126625 {space 3} {res} .56120868 {space 3} {res} .06876519  
{txt}        17{c |} {space 3} {res} 25.627933 {space 3} {res} .55518126 {space 3} {res} .06848201  
{txt}        18{c |} {space 3} {res} 23.351218 {space 3} {res} .55046904 {space 3} {res} .06858147  
{txt}        19{c |} {space 3} {res}  21.27676 {space 3} {res} .54672441 {space 3} {res} .06878863  
{txt}        20{c |} {space 3} {res} 19.386592 {space 3} {res} .54398718 {space 3} {res} .06907625  
{txt}        21{c |} {space 3} {res}  17.66434 {space 3} {res}  .5419217 {space 3} {res} .06939205  
{txt}        22{c |} {space 3} {res} 16.095089 {space 3} {res} .54003365 {space 3} {res}  .0696544  
{txt}        23{c |} {space 3} {res} 14.665246 {space 3} {res} .53850529 {space 3} {res} .06989114  
{txt}        24{c |} {space 3} {res} 13.362426 {space 3} {res} .53812578 {space 3} {res} .07012989  
{txt}        25{c |} {space 3} {res} 12.175345 {space 3} {res} .53832579 {space 3} {res} .07035321  
{txt}        26{c |} {space 3} {res} 11.093721 {space 3} {res} .53826037 {space 3} {res} .07056447  
{txt}        27{c |} {space 3} {res} 10.108185 {space 3} {res} .53786967 {space 3} {res} .07093189  
{txt}        28{c |} {space 3} {res} 9.2102017 {space 3} {res} .53716141 {space 3} {res} .07087613  
{txt}        29{c |} {space 3} {res} 8.3919928 {space 3} {res} .53666367 {space 3} {res} .07106226  
{txt}        30{c |} {space 3} {res} 7.6464713 {space 3} {res} .53605999 {space 3} {res} .07151172  
{txt}        31{c |} {space 3} {res} 6.9671798 {space 3} {res} .53526344 {space 3} {res} .07217222  
{txt}        32{c |} {space 3} {res} 6.3482348 {space 3} {res} .53469694 {space 3} {res} .07280828  
{txt}        33{c |} {space 3} {res} 5.7842751 {space 3} {res} .53403281 {space 3} {res} .07343641  
{txt}        34{c |} {space 3} {res}  5.270416 {space 3} {res} .53351888 {space 3} {res} .07403369  
{txt}        35{c |} {space 3} {res} 4.8022068 {space 3} {res} .53316651 {space 3} {res} .07459398  
{txt}        36{c |} {space 3} {res}  4.375592 {space 3} {res} .53194544 {space 3} {res} .07533791  
{txt}        37{c |} {space 3} {res} 3.9868765 {space 3} {res} .53071925 {space 3} {res} .07607058  
{txt}        38{c |} {space 3} {res} 3.6326933 {space 3} {res} .52969279 {space 3} {res} .07673514  
{txt}        39{c |} {space 3} {res} 3.3099749 {space 3} {res} .52884208 {space 3} {res} .07733835  
{txt}        40{c |} {space 3} {res} 3.0159258 {space 3} {res}  .5281428 {space 3} {res} .07788621  
{txt}        41{c |} {space 3} {res} 2.7479993 {space 3} {res} .52728948 {space 3} {res} .07835937  
{txt}        42{c |} {space 3} {res} 2.5038746 {space 3} {res} .52648626 {space 3} {res} .07878276  
{txt}        43{c |} {space 3} {res} 2.2814373 {space 3} {res} .52579993 {space 3} {res} .07916793  
{txt}        44{c |} {space 3} {res} 2.0787607 {space 3} {res} .52521238 {space 3} {res} .07951832  
{txt}        45{c |} {space 3} {res} 1.8940893 {space 3} {res} .52468293 {space 3} {res} .07983516  
{txt}        46{c |} {space 3} {res} 1.7258236 {space 3} {res} .52420837 {space 3} {res} .08012221  
{txt}        47{c |} {space 3} {res} 1.5725062 {space 3} {res} .52379813 {space 3} {res} .08038341  
{txt}        48{c |} {space 3} {res} 1.4328091 {space 3} {res} .52342923 {space 3} {res} .08061638  
{txt}        49{c |} {space 3} {res} 1.3055223 {space 3} {res} .52310885 {space 3} {res} .08082854  
{txt}        50{c |} {space 3} {res} 1.1895433 {space 3} {res} .52282994 {space 3} {res} .08102172  
{txt}        51{c |} {space 3} {res} 1.0838675 {space 3} {res} .52258662 {space 3} {res} .08119763  
{txt}        52{c |} {space 3} {res} .98757974 {space 3} {res} .52237389 {space 3} {res}  .0813578  
{txt}        53{c |} {space 3} {res} .89984588 {space 3} {res}  .5221875 {space 3} {res} .08150366  
{txt}        54{c |} {space 3} {res} .81990605 {space 3} {res} .52202385 {space 3} {res} .08163648  
{txt}        55{c |} {space 3} {res} .74706786 {space 3} {res} .52187987 {space 3} {res} .08175743  
{txt}        56{c |} {space 3} {res} .68070041 {space 3} {res} .52175295 {space 3} {res} .08186759  
{txt}        57{c |} {space 3} {res} .62022886 {space 3} {res} .52164084 {space 3} {res}  .0819679  
{txt}        58{c |} {space 3} {res} .56512944 {space 3} {res} .52154162 {space 3} {res} .08205927  
{txt}        59{c |} {space 3} {res} .51492489 {space 3} {res} .52145366 {space 3} {res} .08214248  
{txt}        60{c |} {space 3} {res} .46918039 {space 3} {res} .52137554 {space 3} {res} .08221827  
{txt}        61{c |} {space 3} {res} .42749969 {space 3} {res} .52130604 {space 3} {res} .08228731  
{txt}        62{c |} {space 3} {res}  .3895218 {space 3} {res} .52124411 {space 3} {res} .08235019  
{txt}        63{c |} {space 3} {res} .35491776 {space 3} {res} .52118884 {space 3} {res} .08240746  
{txt}        64{c |} {space 3} {res} .32338784 {space 3} {res} .52114055 {space 3} {res} .08245931  
{txt}        65{c |} {space 3} {res} .29465896 {space 3} {res} .52108975 {space 3} {res} .08250877  
{txt}        66{c |} {space 3} {res} .26848227 {space 3} {res} .52104596 {space 3} {res} .08255328  
{txt}        67{c |} {space 3} {res} .24463104 {space 3} {res} .52100662 {space 3} {res} .08259384  
{txt}        68{c |} {space 3} {res} .22289869 {space 3} {res} .52097124 {space 3} {res} .08263078  
{txt}        69{c |} {space 3} {res} .20309699 {space 3} {res} .52093938 {space 3} {res} .08266443  
{txt}        70{c |} {space 3} {res} .18505441 {space 3} {res} .52091068 {space 3} {res} .08269509  
{txt}        71{c |} {space 3} {res} .16861469 {space 3} {res} .52088478 {space 3} {res} .08272302  
{txt}        72{c |} {space 3} {res} .15363542 {space 3} {res} .52086141 {space 3} {res} .08274846  
{txt}        73{c |} {space 3} {res} .13998688 {space 3} {res} .52084029 {space 3} {res} .08277164  
{txt}        74{c |} {space 3} {res} .12755083 {space 3} {res} .52082121 {space 3} {res} .08279276  
{txt}        75{c |} {space 3} {res} .11621956 {space 3} {res} .52080394 {space 3} {res}   .082812  
{txt}        76{c |} {space 3} {res} .10589494 {space 3} {res} .52078831 {space 3} {res} .08282953  
{txt}        77{c |} {space 3} {res} .09648752 {space 3} {res} .52077416 {space 3} {res}  .0828455  
{txt}        78{c |} {space 3} {res} .08791584 {space 3} {res} .52076134 {space 3} {res} .08286005  
{txt}        79{c |} {space 3} {res} .08010564 {space 3} {res} .52074971 {space 3} {res} .08287331  
{txt}        80{c |} {space 3} {res} .07298927 {space 3} {res} .52073917 {space 3} {res} .08288538  
{txt}        81{c |} {space 3} {res} .06650511 {space 3} {res}  .5207296 {space 3} {res} .08289639  
{txt}        82{c |} {space 3} {res} .06059698 {space 3} {res} .52072092 {space 3} {res} .08290641  
{txt}        83{c |} {space 3} {res} .05521371 {space 3} {res} .52071304 {space 3} {res} .08291555  
{txt}        84{c |} {space 3} {res} .05030867 {space 3} {res} .52070588 {space 3} {res} .08292387  
{txt}        85{c |} {space 3} {res} .04583939 {space 3} {res} .52069938 {space 3} {res} .08293145  
{txt}        86{c |} {space 3} {res} .04176715 {space 3} {res} .52069347 {space 3} {res} .08293836  
{txt}        87{c |} {space 3} {res} .03805667 {space 3} {res}  .5206881 {space 3} {res} .08294466  
{txt}        88{c |} {space 3} {res} .03467582 {space 3} {res} .52068322 {space 3} {res} .08295039  
{txt}        89{c |} {space 3} {res} .03159531 {space 3} {res} .52067878 {space 3} {res} .08295562  
{txt}        90{c |} {space 3} {res} .02878847 {space 3} {res} .52067475 {space 3} {res} .08296038  
{txt}        91{c |} {space 3} {res} .02623098 {space 3} {res} .52067107 {space 3} {res} .08296472  
{txt}        92{c |} {space 3} {res}  .0239007 {space 3} {res} .52066773 {space 3} {res} .08296867  
{txt}        93{c |} {space 3} {res} .02177742 {space 3} {res} .52066469 {space 3} {res} .08297227  
{txt}        94{c |} {space 3} {res} .01984278 {space 3} {res} .52066193 {space 3} {res} .08297555  
{txt}        95{c |} {space 3} {res}    .01808 {space 3} {res} .52065941 {space 3} {res} .08297854  
{txt}        96{c |} {space 3} {res} .01647382 {space 3} {res} .52065712 {space 3} {res} .08298127  
{txt}        97{c |} {space 3} {res} .01501033 {space 3} {res} .52065504 {space 3} {res} .08298375  
{txt}        98{c |} {space 3} {res} .01367686 {space 3} {res} .52065314 {space 3} {res} .08298601  
{txt}        99{c |} {space 3} {res} .01246184 {space 3} {res} .52065141 {space 3} {res} .08298807  
{txt}       100{c |} {space 3} {res} .01135477 {space 3} {res} .52064984 {space 3} {res} .08298995  *
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lopt is at the limit of the lambda range.
{txt}r; t=1.52 9:08:44

{com}. 
. // make sure that partial works
. estimates restore m1
{txt}(results {stata estimates replay m1:m1} are active now)
r; t=0.00 9:08:44

{com}. assert "`e(partial)'"=="svi"
{txt}r; t=0.00 9:08:44

{com}. 
. 
. ********************************************************************************
. *** misc options/syntax checks                                                   ***
. ********************************************************************************
. 
. // Support for inrange(.) and similar [if] expressions:
. cvlasso $model if inrange(age,50,70)

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 132.46591 {space 3} {res} 1.3468706 {space 3} {res} .28051017  
{txt}         2{c |} {space 3} {res}   120.698 {space 3} {res} 1.2663279 {space 3} {res} .28277885  
{txt}         3{c |} {space 3} {res} 109.97553 {space 3} {res} 1.1638371 {space 3} {res}   .264536  
{txt}         4{c |} {space 3} {res}  100.2056 {space 3} {res} 1.0770413 {space 3} {res} .24756594  
{txt}         5{c |} {space 3} {res} 91.303614 {space 3} {res} 1.0050165 {space 3} {res} .23294401  
{txt}         6{c |} {space 3} {res} 83.192453 {space 3} {res} .94628701 {space 3} {res} .22011741  
{txt}         7{c |} {space 3} {res} 75.801865 {space 3} {res} .89729298 {space 3} {res} .20917878  
{txt}         8{c |} {space 3} {res} 69.067836 {space 3} {res} .85344967 {space 3} {res} .19961019  
{txt}         9{c |} {space 3} {res}  62.93204 {space 3} {res} .81748443 {space 3} {res} .19107086  
{txt}        10{c |} {space 3} {res} 57.341331 {space 3} {res} .78605508 {space 3} {res} .18244682  
{txt}        11{c |} {space 3} {res} 52.247285 {space 3} {res} .75803541 {space 3} {res} .17315602  
{txt}        12{c |} {space 3} {res}  47.60578 {space 3} {res} .73426303 {space 3} {res} .16502049  
{txt}        13{c |} {space 3} {res} 43.376614 {space 3} {res} .71347782 {space 3} {res} .15833262  ^
{txt}        14{c |} {space 3} {res} 39.523155 {space 3} {res} .69707931 {space 3} {res} .15282169  
{txt}        15{c |} {space 3} {res} 36.012027 {space 3} {res} .68237011 {space 3} {res} .14860429  
{txt}        16{c |} {space 3} {res} 32.812818 {space 3} {res} .66889356 {space 3} {res} .14535023  
{txt}        17{c |} {space 3} {res} 29.897817 {space 3} {res} .65590514 {space 3} {res} .14211631  
{txt}        18{c |} {space 3} {res} 27.241778 {space 3} {res} .64503617 {space 3} {res} .13902259  
{txt}        19{c |} {space 3} {res} 24.821693 {space 3} {res} .63562948 {space 3} {res} .13625794  
{txt}        20{c |} {space 3} {res} 22.616602 {space 3} {res} .62762356 {space 3} {res} .13380436  
{txt}        21{c |} {space 3} {res} 20.607406 {space 3} {res} .62128712 {space 3} {res} .13161579  
{txt}        22{c |} {space 3} {res} 18.776701 {space 3} {res} .61607581 {space 3} {res} .12968819  
{txt}        23{c |} {space 3} {res}  17.10863 {space 3} {res} .61188759 {space 3} {res} .12804577  
{txt}        24{c |} {space 3} {res} 15.588747 {space 3} {res} .60874875 {space 3} {res} .12669098  
{txt}        25{c |} {space 3} {res} 14.203885 {space 3} {res} .60648266 {space 3} {res} .12563051  
{txt}        26{c |} {space 3} {res} 12.942051 {space 3} {res} .60426662 {space 3} {res} .12474969  
{txt}        27{c |} {space 3} {res} 11.792315 {space 3} {res} .60271636 {space 3} {res} .12409563  
{txt}        28{c |} {space 3} {res} 10.744718 {space 3} {res} .60136927 {space 3} {res} .12343029  *
{txt}        29{c |} {space 3} {res} 9.7901873 {space 3} {res} .60170297 {space 3} {res} .12349762  
{txt}        30{c |} {space 3} {res}  8.920454 {space 3} {res} .60234317 {space 3} {res} .12368115  
{txt}        31{c |} {space 3} {res} 8.1279855 {space 3} {res} .60310956 {space 3} {res} .12391603  
{txt}        32{c |} {space 3} {res} 7.4059177 {space 3} {res} .60395984 {space 3} {res} .12418638  
{txt}        33{c |} {space 3} {res} 6.7479964 {space 3} {res} .60487355 {space 3} {res}  .1244795  
{txt}        34{c |} {space 3} {res}  6.148523 {space 3} {res} .60597985 {space 3} {res} .12482638  
{txt}        35{c |} {space 3} {res} 5.6023051 {space 3} {res} .60776417 {space 3} {res} .12536039  
{txt}        36{c |} {space 3} {res} 5.1046118 {space 3} {res} .60959965 {space 3} {res} .12584385  
{txt}        37{c |} {space 3} {res} 4.6511321 {space 3} {res} .61221633 {space 3} {res}  .1263669  
{txt}        38{c |} {space 3} {res} 4.2379384 {space 3} {res} .61481434 {space 3} {res}  .1268844  
{txt}        39{c |} {space 3} {res} 3.8614516 {space 3} {res} .61771782 {space 3} {res} .12755085  
{txt}        40{c |} {space 3} {res} 3.5184109 {space 3} {res} .62073803 {space 3} {res} .12827423  
{txt}        41{c |} {space 3} {res}  3.205845 {space 3} {res} .62357635 {space 3} {res} .12896182  
{txt}        42{c |} {space 3} {res} 2.9210465 {space 3} {res} .62629897 {space 3} {res} .12962817  
{txt}        43{c |} {space 3} {res} 2.6615488 {space 3} {res} .62882016 {space 3} {res} .13030472  
{txt}        44{c |} {space 3} {res} 2.4251041 {space 3} {res} .63088099 {space 3} {res} .13095931  
{txt}        45{c |} {space 3} {res} 2.2096646 {space 3} {res} .63277656 {space 3} {res} .13152733  
{txt}        46{c |} {space 3} {res} 2.0133641 {space 3} {res} .63433622 {space 3} {res} .13205671  
{txt}        47{c |} {space 3} {res} 1.8345024 {space 3} {res} .63558327 {space 3} {res}  .1326299  
{txt}        48{c |} {space 3} {res} 1.6715302 {space 3} {res} .63671217 {space 3} {res} .13317171  
{txt}        49{c |} {space 3} {res} 1.5230361 {space 3} {res} .63775095 {space 3} {res} .13366803  
{txt}        50{c |} {space 3} {res} 1.3877338 {space 3} {res} .63873225 {space 3} {res} .13412088  
{txt}        51{c |} {space 3} {res} 1.2644513 {space 3} {res} .63965926 {space 3} {res} .13453374  
{txt}        52{c |} {space 3} {res} 1.1521209 {space 3} {res} .64053124 {space 3} {res} .13491011  
{txt}        53{c |} {space 3} {res} 1.0497697 {space 3} {res} .64134842 {space 3} {res} .13525318  
{txt}        54{c |} {space 3} {res} .95651105 {space 3} {res} .64211183 {space 3} {res} .13556589  
{txt}        55{c |} {space 3} {res} .87153724 {space 3} {res} .64280169 {space 3} {res} .13585909  
{txt}        56{c |} {space 3} {res} .79411228 {space 3} {res} .64342633 {space 3} {res} .13613282  
{txt}        57{c |} {space 3} {res} .72356553 {space 3} {res}  .6440069 {space 3} {res} .13638206  
{txt}        58{c |} {space 3} {res} .65928596 {space 3} {res} .64454537 {space 3} {res} .13660901  
{txt}        59{c |} {space 3} {res} .60071681 {space 3} {res} .64504388 {space 3} {res} .13681568  
{txt}        60{c |} {space 3} {res} .54735079 {space 3} {res} .64534099 {space 3} {res} .13692261  
{txt}        61{c |} {space 3} {res} .49872565 {space 3} {res} .64560982 {space 3} {res} .13701649  
{txt}        62{c |} {space 3} {res} .45442024 {space 3} {res} .64584187 {space 3} {res} .13710724  
{txt}        63{c |} {space 3} {res}  .4140508 {space 3} {res} .64605003 {space 3} {res} .13719209  
{txt}        64{c |} {space 3} {res} .37726767 {space 3} {res}   .646243 {space 3} {res} .13726943  
{txt}        65{c |} {space 3} {res} .34375225 {space 3} {res} .64642158 {space 3} {res} .13733993  
{txt}        66{c |} {space 3} {res} .31321425 {space 3} {res} .64658657 {space 3} {res} .13740419  
{txt}        67{c |} {space 3} {res} .28538915 {space 3} {res} .64673881 {space 3} {res} .13746276  
{txt}        68{c |} {space 3} {res} .26003597 {space 3} {res} .64687909 {space 3} {res} .13751615  
{txt}        69{c |} {space 3} {res} .23693509 {space 3} {res} .64700821 {space 3} {res} .13756481  
{txt}        70{c |} {space 3} {res} .21588643 {space 3} {res} .64712695 {space 3} {res} .13760915  
{txt}        71{c |} {space 3} {res} .19670767 {space 3} {res} .64723604 {space 3} {res} .13764957  
{txt}        72{c |} {space 3} {res} .17923271 {space 3} {res} .64733618 {space 3} {res}  .1376864  
{txt}        73{c |} {space 3} {res} .16331017 {space 3} {res} .64742805 {space 3} {res} .13771997  
{txt}        74{c |} {space 3} {res} .14880214 {space 3} {res} .64751227 {space 3} {res} .13775056  
{txt}        75{c |} {space 3} {res} .13558297 {space 3} {res} .64758944 {space 3} {res} .13777844  
{txt}        76{c |} {space 3} {res} .12353815 {space 3} {res}  .6476601 {space 3} {res} .13780385  
{txt}        77{c |} {space 3} {res} .11256336 {space 3} {res} .64772479 {space 3} {res}   .137827  
{txt}        78{c |} {space 3} {res} .10256354 {space 3} {res} .64778397 {space 3} {res}  .1378481  
{txt}        79{c |} {space 3} {res} .09345208 {space 3} {res}  .6478381 {space 3} {res} .13786732  
{txt}        80{c |} {space 3} {res} .08515006 {space 3} {res} .64788759 {space 3} {res} .13788484  
{txt}        81{c |} {space 3} {res} .07758556 {space 3} {res} .64793282 {space 3} {res}  .1379008  
{txt}        82{c |} {space 3} {res} .07069307 {space 3} {res} .64797415 {space 3} {res} .13791535  
{txt}        83{c |} {space 3} {res}  .0644129 {space 3} {res}  .6480119 {space 3} {res} .13792861  
{txt}        84{c |} {space 3} {res} .05869063 {space 3} {res} .64804638 {space 3} {res} .13794069  
{txt}        85{c |} {space 3} {res} .05347672 {space 3} {res} .64807786 {space 3} {res} .13795169  
{txt}        86{c |} {space 3} {res} .04872599 {space 3} {res} .64810661 {space 3} {res} .13796172  
{txt}        87{c |} {space 3} {res} .04439731 {space 3} {res} .64813284 {space 3} {res} .13797086  
{txt}        88{c |} {space 3} {res} .04045318 {space 3} {res} .64815678 {space 3} {res} .13797919  
{txt}        89{c |} {space 3} {res} .03685943 {space 3} {res} .64817863 {space 3} {res} .13798678  
{txt}        90{c |} {space 3} {res} .03358494 {space 3} {res} .64819856 {space 3} {res} .13799369  
{txt}        91{c |} {space 3} {res} .03060134 {space 3} {res} .64821675 {space 3} {res} .13799999  
{txt}        92{c |} {space 3} {res}  .0278828 {space 3} {res} .64823333 {space 3} {res} .13800573  
{txt}        93{c |} {space 3} {res} .02540577 {space 3} {res} .64824846 {space 3} {res} .13801096  
{txt}        94{c |} {space 3} {res} .02314879 {space 3} {res} .64826225 {space 3} {res} .13801573  
{txt}        95{c |} {space 3} {res} .02109232 {space 3} {res} .64827484 {space 3} {res} .13802007  
{txt}        96{c |} {space 3} {res} .01921854 {space 3} {res} .64828631 {space 3} {res} .13802403  
{txt}        97{c |} {space 3} {res} .01751121 {space 3} {res} .64829677 {space 3} {res} .13802764  
{txt}        98{c |} {space 3} {res} .01595557 {space 3} {res}  .6483063 {space 3} {res} .13803092  
{txt}        99{c |} {space 3} {res} .01453812 {space 3} {res}   .648315 {space 3} {res} .13803392  
{txt}       100{c |} {space 3} {res} .01324659 {space 3} {res} .64832292 {space 3} {res} .13803664  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=0.96 9:08:45

{com}. 
. ********************************************************************************
. *** plotting                                                                                             ***
. ********************************************************************************
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 9:08:45

{com}. 
. cvlasso $model, plotcv

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 163.62492 {space 3} {res}  1.333319 {space 3} {res} .20089729  
{txt}         2{c |} {space 3} {res} 149.08894 {space 3} {res} 1.2420647 {space 3} {res} .19385317  
{txt}         3{c |} {space 3} {res} 135.84429 {space 3} {res} 1.1387822 {space 3} {res}   .177899  
{txt}         4{c |} {space 3} {res} 123.77625 {space 3} {res} 1.0531517 {space 3} {res} .16424841  
{txt}         5{c |} {space 3} {res} 112.78031 {space 3} {res} .98216599 {space 3} {res} .15250138  
{txt}         6{c |} {space 3} {res} 102.76122 {space 3} {res} .92332908 {space 3} {res} .14233858  
{txt}         7{c |} {space 3} {res} 93.632197 {space 3} {res} .87456976 {space 3} {res} .13350476  
{txt}         8{c |} {space 3} {res} 85.314171 {space 3} {res} .83420647 {space 3} {res} .12570416  
{txt}         9{c |} {space 3} {res} 77.735095 {space 3} {res} .79993609 {space 3} {res} .11875212  
{txt}        10{c |} {space 3} {res} 70.829323 {space 3} {res} .76609365 {space 3} {res} .11248448  
{txt}        11{c |} {space 3} {res} 64.537041 {space 3} {res} .73282703 {space 3} {res} .10780767  
{txt}        12{c |} {space 3} {res} 58.803749 {space 3} {res} .69912922 {space 3} {res} .10256908  
{txt}        13{c |} {space 3} {res} 53.579786 {space 3} {res}   .669818 {space 3} {res}  .0976207  
{txt}        14{c |} {space 3} {res} 48.819905 {space 3} {res} .64551004 {space 3} {res} .09356449  
{txt}        15{c |} {space 3} {res} 44.482879 {space 3} {res} .62535025 {space 3} {res}  .0902793  ^
{txt}        16{c |} {space 3} {res} 40.531143 {space 3} {res} .60920075 {space 3} {res} .08743039  
{txt}        17{c |} {space 3} {res} 36.930468 {space 3} {res} .59590953 {space 3} {res} .08515487  
{txt}        18{c |} {space 3} {res} 33.649667 {space 3} {res} .58544829 {space 3} {res} .08345446  
{txt}        19{c |} {space 3} {res} 30.660323 {space 3} {res} .57789692 {space 3} {res} .08243322  
{txt}        20{c |} {space 3} {res} 27.936545 {space 3} {res}  .5724866 {space 3} {res}  .0815623  
{txt}        21{c |} {space 3} {res} 25.454739 {space 3} {res} .56847109 {space 3} {res} .08089575  
{txt}        22{c |} {space 3} {res}  23.19341 {space 3} {res} .56514785 {space 3} {res} .08043522  
{txt}        23{c |} {space 3} {res} 21.132972 {space 3} {res} .56189348 {space 3} {res}  .0802513  
{txt}        24{c |} {space 3} {res} 19.255577 {space 3} {res}  .5588219 {space 3} {res} .08036486  
{txt}        25{c |} {space 3} {res} 17.544964 {space 3} {res} .55577411 {space 3} {res}  .0807328  
{txt}        26{c |} {space 3} {res} 15.986318 {space 3} {res} .55325411 {space 3} {res} .08111917  
{txt}        27{c |} {space 3} {res} 14.566138 {space 3} {res} .55146435 {space 3} {res} .08130164  
{txt}        28{c |} {space 3} {res} 13.272122 {space 3} {res} .55118766 {space 3} {res} .08146513  
{txt}        29{c |} {space 3} {res} 12.093063 {space 3} {res} .55099552 {space 3} {res} .08177064  
{txt}        30{c |} {space 3} {res} 11.018749 {space 3} {res} .55088363 {space 3} {res} .08210567  
{txt}        31{c |} {space 3} {res} 10.039874 {space 3} {res} .55110601 {space 3} {res} .08242346  
{txt}        32{c |} {space 3} {res} 9.1479589 {space 3} {res} .55111023 {space 3} {res}  .0827693  
{txt}        33{c |} {space 3} {res} 8.3352794 {space 3} {res} .54999146 {space 3} {res} .08319763  
{txt}        34{c |} {space 3} {res} 7.5947962 {space 3} {res} .54846465 {space 3} {res} .08332853  
{txt}        35{c |} {space 3} {res} 6.9200954 {space 3} {res} .54729517 {space 3} {res} .08348564  
{txt}        36{c |} {space 3} {res} 6.3053332 {space 3} {res} .54684846 {space 3} {res} .08385284  
{txt}        37{c |} {space 3} {res} 5.7451848 {space 3} {res} .54691285 {space 3} {res} .08427171  
{txt}        38{c |} {space 3} {res} 5.2347984 {space 3} {res} .54744963 {space 3} {res} .08462423  
{txt}        39{c |} {space 3} {res} 4.7697533 {space 3} {res} .54808502 {space 3} {res} .08495417  
{txt}        40{c |} {space 3} {res} 4.3460216 {space 3} {res} .54879163 {space 3} {res} .08526634  
{txt}        41{c |} {space 3} {res}  3.959933 {space 3} {res} .54933821 {space 3} {res} .08562963  
{txt}        42{c |} {space 3} {res} 3.6081435 {space 3} {res} .54941743 {space 3} {res}  .0860535  
{txt}        43{c |} {space 3} {res}  3.287606 {space 3} {res} .54908836 {space 3} {res} .08649829  
{txt}        44{c |} {space 3} {res} 2.9955441 {space 3} {res} .54875064 {space 3} {res} .08685923  
{txt}        45{c |} {space 3} {res} 2.7294282 {space 3} {res}  .5481921 {space 3} {res} .08695813  
{txt}        46{c |} {space 3} {res} 2.4869533 {space 3} {res} .54742296 {space 3} {res} .08702243  
{txt}        47{c |} {space 3} {res} 2.2660193 {space 3} {res} .54677854 {space 3} {res} .08709007  
{txt}        48{c |} {space 3} {res} 2.0647124 {space 3} {res} .54623847 {space 3} {res} .08716004  
{txt}        49{c |} {space 3} {res}  1.881289 {space 3} {res}  .5457992 {space 3} {res} .08722744  
{txt}        50{c |} {space 3} {res} 1.7141605 {space 3} {res} .54544279 {space 3} {res} .08729181  
{txt}        51{c |} {space 3} {res} 1.5618792 {space 3} {res} .54515446 {space 3} {res} .08735287  
{txt}        52{c |} {space 3} {res} 1.4231261 {space 3} {res} .54492196 {space 3} {res} .08741047  
{txt}        53{c |} {space 3} {res} 1.2966995 {space 3} {res} .54474678 {space 3} {res} .08746371  *
{txt}        54{c |} {space 3} {res} 1.1815043 {space 3} {res} .54477019 {space 3} {res} .08750238  
{txt}        55{c |} {space 3} {res} 1.0765427 {space 3} {res} .54481303 {space 3} {res} .08753934  
{txt}        56{c |} {space 3} {res} .98090565 {space 3} {res} .54486992 {space 3} {res} .08757449  
{txt}        57{c |} {space 3} {res} .89376469 {space 3} {res} .54493659 {space 3} {res} .08760776  
{txt}        58{c |} {space 3} {res}  .8143651 {space 3} {res} .54500964 {space 3} {res} .08763914  
{txt}        59{c |} {space 3} {res} .74201915 {space 3} {res} .54508642 {space 3} {res} .08766863  
{txt}        60{c |} {space 3} {res} .67610021 {space 3} {res} .54516486 {space 3} {res} .08769625  
{txt}        61{c |} {space 3} {res} .61603733 {space 3} {res} .54524338 {space 3} {res} .08772206  
{txt}        62{c |} {space 3} {res} .56131027 {space 3} {res} .54533234 {space 3} {res} .08774575  
{txt}        63{c |} {space 3} {res} .51144502 {space 3} {res} .54544399 {space 3} {res} .08776693  
{txt}        64{c |} {space 3} {res} .46600965 {space 3} {res} .54554976 {space 3} {res} .08778657  
{txt}        65{c |} {space 3} {res} .42461064 {space 3} {res} .54564951 {space 3} {res} .08780475  
{txt}        66{c |} {space 3} {res}  .3868894 {space 3} {res} .54574318 {space 3} {res} .08782155  
{txt}        67{c |} {space 3} {res} .35251921 {space 3} {res} .54583086 {space 3} {res} .08783705  
{txt}        68{c |} {space 3} {res} .32120238 {space 3} {res} .54591267 {space 3} {res} .08785134  
{txt}        69{c |} {space 3} {res} .29266764 {space 3} {res} .54598881 {space 3} {res}  .0878645  
{txt}        70{c |} {space 3} {res} .26666786 {space 3} {res} .54605951 {space 3} {res}  .0878766  
{txt}        71{c |} {space 3} {res} .24297782 {space 3} {res} .54612504 {space 3} {res} .08788773  
{txt}        72{c |} {space 3} {res} .22139234 {space 3} {res} .54618566 {space 3} {res} .08789795  
{txt}        73{c |} {space 3} {res} .20172445 {space 3} {res} .54624165 {space 3} {res} .08790733  
{txt}        74{c |} {space 3} {res} .18380381 {space 3} {res}  .5462933 {space 3} {res} .08791593  
{txt}        75{c |} {space 3} {res} .16747519 {space 3} {res} .54634088 {space 3} {res} .08792382  
{txt}        76{c |} {space 3} {res} .15259715 {space 3} {res} .54638467 {space 3} {res} .08793104  
{txt}        77{c |} {space 3} {res} .13904084 {space 3} {res} .54642493 {space 3} {res} .08793765  
{txt}        78{c |} {space 3} {res} .12668884 {space 3} {res} .54646192 {space 3} {res} .08794371  
{txt}        79{c |} {space 3} {res} .11543415 {space 3} {res} .54649587 {space 3} {res} .08794925  
{txt}        80{c |} {space 3} {res}  .1051793 {space 3} {res}   .546527 {space 3} {res} .08795431  
{txt}        81{c |} {space 3} {res} .09583546 {space 3} {res} .54655555 {space 3} {res} .08795894  
{txt}        82{c |} {space 3} {res}  .0873217 {space 3} {res}  .5465817 {space 3} {res} .08796318  
{txt}        83{c |} {space 3} {res} .07956428 {space 3} {res} .54660564 {space 3} {res} .08796705  
{txt}        84{c |} {space 3} {res} .07249601 {space 3} {res} .54662756 {space 3} {res} .08797058  
{txt}        85{c |} {space 3} {res} .06605566 {space 3} {res} .54664761 {space 3} {res} .08797381  
{txt}        86{c |} {space 3} {res} .06018746 {space 3} {res}  .5466655 {space 3} {res} .08797673  
{txt}        87{c |} {space 3} {res} .05484057 {space 3} {res} .54668148 {space 3} {res} .08797937  
{txt}        88{c |} {space 3} {res} .04996869 {space 3} {res} .54669537 {space 3} {res} .08798174  
{txt}        89{c |} {space 3} {res} .04552961 {space 3} {res} .54670848 {space 3} {res} .08798392  
{txt}        90{c |} {space 3} {res} .04148488 {space 3} {res} .54672046 {space 3} {res} .08798592  
{txt}        91{c |} {space 3} {res} .03779948 {space 3} {res} .54673141 {space 3} {res} .08798774  
{txt}        92{c |} {space 3} {res} .03444148 {space 3} {res}  .5467414 {space 3} {res}  .0879894  
{txt}        93{c |} {space 3} {res} .03138179 {space 3} {res} .54675052 {space 3} {res} .08799092  
{txt}        94{c |} {space 3} {res} .02859392 {space 3} {res} .54675885 {space 3} {res}  .0879923  
{txt}        95{c |} {space 3} {res} .02605372 {space 3} {res} .54676645 {space 3} {res} .08799356  
{txt}        96{c |} {space 3} {res} .02373917 {space 3} {res} .54677339 {space 3} {res} .08799471  
{txt}        97{c |} {space 3} {res} .02163025 {space 3} {res} .54677972 {space 3} {res} .08799576  
{txt}        98{c |} {space 3} {res} .01970868 {space 3} {res} .54678549 {space 3} {res} .08799672  
{txt}        99{c |} {space 3} {res} .01795782 {space 3} {res} .54679076 {space 3} {res} .08799759  
{txt}       100{c |} {space 3} {res} .01636249 {space 3} {res} .54679556 {space 3} {res} .08799838  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{res}{txt}r; t=1.96 9:08:47

{com}. 
. ********************************************************************************
. *** time-series example with rolling cv                                      ***
. ********************************************************************************
. 
. webuse air2, clear
{txt}(TIMESLAB: Airline passengers)
r; t=0.44 9:08:47

{com}.  
. cvlasso air L(1/12).air, rolling origin(130)
{txt}Rolling forecasting cross-validation with 1-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (131), 13-131 (132), 13-132 (133), 13-133 (134), 13-134 (135), 13-135 (136), 13-136 (137), 13-137 (138), 13-138 (139), 13-139 (140), 13-140 (141), 13-141 (142), 13-142 (143), 13-143 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 30083.535 {space 3} {res} 33237.193 {space 3} {res} 8731.4325  
{txt}         2{c |} {space 3} {res} 27410.996 {space 3} {res} 27799.242 {space 3} {res} 7290.3087  
{txt}         3{c |} {space 3} {res} 24975.879 {space 3} {res} 23267.301 {space 3} {res} 6092.3376  
{txt}         4{c |} {space 3} {res} 22757.091 {space 3} {res} 19493.102 {space 3} {res}  5095.861  
{txt}         5{c |} {space 3} {res} 20735.414 {space 3} {res} 16349.032 {space 3} {res} 4266.8189  
{txt}         6{c |} {space 3} {res} 18893.337 {space 3} {res} 13729.055 {space 3} {res} 3576.9191  
{txt}         7{c |} {space 3} {res} 17214.905 {space 3} {res} 11545.052 {space 3} {res} 3002.6587  
{txt}         8{c |} {space 3} {res}  15685.58 {space 3} {res} 9723.7885 {space 3} {res} 2524.5123  
{txt}         9{c |} {space 3} {res} 14292.116 {space 3} {res} 8204.3942 {space 3} {res} 2126.2578  
{txt}        10{c |} {space 3} {res} 13022.444 {space 3} {res} 6936.2699 {space 3} {res} 1794.4166  
{txt}        11{c |} {space 3} {res} 11865.566 {space 3} {res} 5877.3493 {space 3} {res} 1517.7888  
{txt}        12{c |} {space 3} {res} 10811.462 {space 3} {res} 4992.6553 {space 3} {res} 1287.0672  
{txt}        13{c |} {space 3} {res} 9851.0014 {space 3} {res} 4253.1013 {space 3} {res} 1094.5174  
{txt}        14{c |} {space 3} {res} 8975.8656 {space 3} {res}  3635.824 {space 3} {res} 936.22874  
{txt}        15{c |} {space 3} {res} 8178.4744 {space 3} {res} 3111.7137 {space 3} {res} 812.75242  
{txt}        16{c |} {space 3} {res} 7451.9213 {space 3} {res} 2669.6887 {space 3} {res} 708.75189  
{txt}        17{c |} {space 3} {res} 6789.9131 {space 3} {res} 2300.5206 {space 3} {res} 621.98344  
{txt}        18{c |} {space 3} {res}  6186.716 {space 3} {res} 1992.0343 {space 3} {res} 549.37699  
{txt}        19{c |} {space 3} {res} 5637.1052 {space 3} {res} 1734.1043 {space 3} {res} 488.40062  
{txt}        20{c |} {space 3} {res} 5136.3203 {space 3} {res} 1518.3087 {space 3} {res} 436.97343  
{txt}        21{c |} {space 3} {res} 4680.0237 {space 3} {res} 1337.6412 {space 3} {res} 393.39186  
{txt}        22{c |} {space 3} {res} 4264.2633 {space 3} {res} 1186.2716 {space 3} {res} 356.26673  
{txt}        23{c |} {space 3} {res} 3885.4379 {space 3} {res} 1059.3481 {space 3} {res} 324.46942  
{txt}        24{c |} {space 3} {res} 3540.2663 {space 3} {res}  952.8315 {space 3} {res} 297.08581  
{txt}        25{c |} {space 3} {res} 3225.7588 {space 3} {res} 863.35854 {space 3} {res}  273.3769  
{txt}        26{c |} {space 3} {res} 2939.1913 {space 3} {res}   788.491 {space 3} {res} 252.67635  
{txt}        27{c |} {space 3} {res} 2678.0817 {space 3} {res} 725.70704 {space 3} {res} 234.57369  
{txt}        28{c |} {space 3} {res} 2440.1683 {space 3} {res} 670.22718 {space 3} {res} 218.23327  
{txt}        29{c |} {space 3} {res} 2223.3904 {space 3} {res} 622.52635 {space 3} {res} 203.38451  
{txt}        30{c |} {space 3} {res} 2025.8706 {space 3} {res} 581.16825 {space 3} {res} 190.03867  
{txt}        31{c |} {space 3} {res} 1845.8978 {space 3} {res} 546.16451 {space 3} {res} 178.31137  
{txt}        32{c |} {space 3} {res} 1681.9133 {space 3} {res} 516.49556 {space 3} {res} 168.00213  
{txt}        33{c |} {space 3} {res} 1532.4968 {space 3} {res} 491.30969 {space 3} {res} 158.93797  
{txt}        34{c |} {space 3} {res}  1396.354 {space 3} {res} 469.89498 {space 3} {res} 150.96867  
{txt}        35{c |} {space 3} {res} 1272.3058 {space 3} {res} 451.65601 {space 3} {res}  143.9631  ^
{txt}        36{c |} {space 3} {res} 1159.2776 {space 3} {res} 436.09447 {space 3} {res} 137.80621  
{txt}        37{c |} {space 3} {res} 1056.2906 {space 3} {res} 422.79303 {space 3} {res} 132.39667  
{txt}        38{c |} {space 3} {res} 962.45264 {space 3} {res} 411.40189 {space 3} {res} 127.64501  
{txt}        39{c |} {space 3} {res}   876.951 {space 3} {res} 401.62764 {space 3} {res} 123.47207  
{txt}        40{c |} {space 3} {res} 799.04509 {space 3} {res} 393.22392 {space 3} {res} 119.80779  
{txt}        41{c |} {space 3} {res} 728.06013 {space 3} {res} 385.98373 {space 3} {res} 116.59019  
{txt}        42{c |} {space 3} {res} 663.38127 {space 3} {res}  379.7329 {space 3} {res} 113.76442  
{txt}        43{c |} {space 3} {res} 604.44831 {space 3} {res} 374.32476 {space 3} {res} 111.28209  
{txt}        44{c |} {space 3} {res} 550.75079 {space 3} {res} 369.63567 {space 3} {res} 109.10052  
{txt}        45{c |} {space 3} {res} 501.82361 {space 3} {res} 365.56123 {space 3} {res} 107.18216  
{txt}        46{c |} {space 3} {res} 457.24298 {space 3} {res}  362.0132 {space 3} {res} 105.49406  
{txt}        47{c |} {space 3} {res} 416.62277 {space 3} {res} 358.91691 {space 3} {res} 104.00732  
{txt}        48{c |} {space 3} {res} 379.61115 {space 3} {res} 356.20904 {space 3} {res} 102.69665  
{txt}        49{c |} {space 3} {res} 345.88755 {space 3} {res} 353.83583 {space 3} {res} 101.53998  
{txt}        50{c |} {space 3} {res} 315.15985 {space 3} {res}  352.3553 {space 3} {res} 100.65556  *
{txt}        51{c |} {space 3} {res} 287.16192 {space 3} {res} 356.42305 {space 3} {res} 101.19582  
{txt}        52{c |} {space 3} {res} 261.65124 {space 3} {res} 363.33054 {space 3} {res} 102.75269  
{txt}        53{c |} {space 3} {res} 238.40687 {space 3} {res} 370.44865 {space 3} {res} 105.00085  
{txt}        54{c |} {space 3} {res} 217.22746 {space 3} {res} 372.21202 {space 3} {res} 106.53333  
{txt}        55{c |} {space 3} {res} 197.92957 {space 3} {res} 373.58108 {space 3} {res} 108.17032  
{txt}        56{c |} {space 3} {res} 180.34605 {space 3} {res} 375.89938 {space 3} {res} 109.80358  
{txt}        57{c |} {space 3} {res} 164.32461 {space 3} {res} 378.99098 {space 3} {res} 111.37688  
{txt}        58{c |} {space 3} {res} 149.72646 {space 3} {res} 380.49347 {space 3} {res} 112.55753  
{txt}        59{c |} {space 3} {res} 136.42518 {space 3} {res} 381.08165 {space 3} {res} 113.73224  
{txt}        60{c |} {space 3} {res} 124.30554 {space 3} {res} 381.60207 {space 3} {res} 114.93783  
{txt}        61{c |} {space 3} {res} 113.26258 {space 3} {res} 380.71469 {space 3} {res}  115.6034  
{txt}        62{c |} {space 3} {res} 103.20064 {space 3} {res} 379.53228 {space 3} {res} 116.00241  
{txt}        63{c |} {space 3} {res} 94.032582 {space 3} {res} 380.74666 {space 3} {res} 117.01678  
{txt}        64{c |} {space 3} {res} 85.678986 {space 3} {res} 382.39512 {space 3} {res} 117.92244  
{txt}        65{c |} {space 3} {res} 78.067501 {space 3} {res} 382.00813 {space 3} {res} 118.30133  
{txt}        66{c |} {space 3} {res}   71.1322 {space 3} {res} 379.53614 {space 3} {res} 118.33073  
{txt}        67{c |} {space 3} {res} 64.813011 {space 3} {res} 377.47621 {space 3} {res} 118.59801  
{txt}        68{c |} {space 3} {res} 59.055202 {space 3} {res} 376.71111 {space 3} {res} 119.05724  
{txt}        69{c |} {space 3} {res}   53.8089 {space 3} {res} 376.19828 {space 3} {res} 119.49392  
{txt}        70{c |} {space 3} {res} 49.028666 {space 3} {res} 375.22278 {space 3} {res} 119.97715  
{txt}        71{c |} {space 3} {res} 44.673094 {space 3} {res} 373.26668 {space 3} {res} 120.18322  
{txt}        72{c |} {space 3} {res}  40.70446 {space 3} {res} 372.49456 {space 3} {res} 120.43289  
{txt}        73{c |} {space 3} {res} 37.088388 {space 3} {res} 372.59088 {space 3} {res} 120.82114  
{txt}        74{c |} {space 3} {res} 33.793558 {space 3} {res} 374.04884 {space 3} {res} 121.19229  
{txt}        75{c |} {space 3} {res} 30.791431 {space 3} {res}  377.5105 {space 3} {res} 121.17767  
{txt}        76{c |} {space 3} {res} 28.056005 {space 3} {res} 381.87875 {space 3} {res} 121.00114  
{txt}        77{c |} {space 3} {res} 25.563587 {space 3} {res} 385.86197 {space 3} {res} 120.80072  
{txt}        78{c |} {space 3} {res} 23.292588 {space 3} {res} 389.16575 {space 3} {res} 120.36636  
{txt}        79{c |} {space 3} {res} 21.223339 {space 3} {res} 392.38507 {space 3} {res} 120.08113  
{txt}        80{c |} {space 3} {res} 19.337916 {space 3} {res} 396.88113 {space 3} {res}  120.4689  
{txt}        81{c |} {space 3} {res} 17.619989 {space 3} {res} 402.63138 {space 3} {res} 121.19743  
{txt}        82{c |} {space 3} {res} 16.054678 {space 3} {res} 412.30702 {space 3} {res} 121.83665  
{txt}        83{c |} {space 3} {res} 14.628424 {space 3} {res} 421.09094 {space 3} {res} 121.51485  
{txt}        84{c |} {space 3} {res} 13.328875 {space 3} {res} 426.86241 {space 3} {res}  120.2055  
{txt}        85{c |} {space 3} {res} 12.144775 {space 3} {res} 431.12421 {space 3} {res} 119.04316  
{txt}        86{c |} {space 3} {res} 11.065867 {space 3} {res} 433.74587 {space 3} {res} 118.05604  
{txt}        87{c |} {space 3} {res} 10.082806 {space 3} {res} 436.53986 {space 3} {res} 117.36929  
{txt}        88{c |} {space 3} {res} 9.1870769 {space 3} {res} 439.42206 {space 3} {res} 116.91838  
{txt}        89{c |} {space 3} {res} 8.3709223 {space 3} {res} 442.32753 {space 3} {res} 116.65087  
{txt}        90{c |} {space 3} {res} 7.6272726 {space 3} {res} 445.20676 {space 3} {res}  116.5244  
{txt}        91{c |} {space 3} {res} 6.9496867 {space 3} {res} 448.02273 {space 3} {res} 116.50501  
{txt}        92{c |} {space 3} {res} 6.3322957 {space 3} {res} 450.74836 {space 3} {res} 116.56561  
{txt}        93{c |} {space 3} {res}  5.769752 {space 3} {res} 453.36455 {space 3} {res} 116.68474  
{txt}        94{c |} {space 3} {res} 5.2571831 {space 3} {res} 455.85849 {space 3} {res} 116.84547  
{txt}        95{c |} {space 3} {res} 4.7901495 {space 3} {res} 458.22233 {space 3} {res} 117.03456  
{txt}        96{c |} {space 3} {res} 4.3646058 {space 3} {res} 460.45211 {space 3} {res} 117.24169  
{txt}        97{c |} {space 3} {res} 3.9768663 {space 3} {res} 462.54684 {space 3} {res} 117.45892  
{txt}        98{c |} {space 3} {res} 3.6235724 {space 3} {res} 464.50782 {space 3} {res} 117.68017  
{txt}        99{c |} {space 3} {res} 3.3016642 {space 3} {res} 466.33804 {space 3} {res} 117.90088  
{txt}       100{c |} {space 3} {res} 3.0083535 {space 3} {res} 468.04174 {space 3} {res} 118.11764  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=12.75 9:09:00

{com}. // we should have 144-130=14 folds
. assert 14==`e(nfolds)'
{txt}r; t=0.00 9:09:00

{com}. 
. cvlasso air L(1/12).air, rolling origin(130) h(2)
{txt}Rolling forecasting cross-validation with 2-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (132), 13-131 (133), 13-132 (134), 13-133 (135), 13-134 (136), 13-135 (137), 13-136 (138), 13-137 (139), 13-138 (140), 13-139 (141), 13-140 (142), 13-141 (143), 13-142 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 30083.535 {space 3} {res} 34952.233 {space 3} {res} 8972.5481  
{txt}         2{c |} {space 3} {res} 27410.996 {space 3} {res} 29219.469 {space 3} {res} 7495.1704  
{txt}         3{c |} {space 3} {res} 24975.879 {space 3} {res} 24447.167 {space 3} {res} 6266.3552  
{txt}         4{c |} {space 3} {res} 22757.091 {space 3} {res} 20473.399 {space 3} {res} 5244.0824  
{txt}         5{c |} {space 3} {res} 20735.414 {space 3} {res} 17163.629 {space 3} {res} 4393.4479  
{txt}         6{c |} {space 3} {res} 18893.337 {space 3} {res}  14406.07 {space 3} {res}  3685.457  
{txt}         7{c |} {space 3} {res} 17214.905 {space 3} {res} 12107.831 {space 3} {res} 3096.0221  
{txt}         8{c |} {space 3} {res}  15685.58 {space 3} {res} 10191.716 {space 3} {res} 2605.1314  
{txt}         9{c |} {space 3} {res} 14292.116 {space 3} {res} 8593.5634 {space 3} {res} 2196.1576  
{txt}        10{c |} {space 3} {res} 13022.444 {space 3} {res}  7260.043 {space 3} {res} 1855.2848  
{txt}        11{c |} {space 3} {res} 11865.566 {space 3} {res} 6146.8207 {space 3} {res} 1571.0323  
{txt}        12{c |} {space 3} {res} 10811.462 {space 3} {res} 5217.0365 {space 3} {res} 1333.8591  
{txt}        13{c |} {space 3} {res} 9851.0014 {space 3} {res} 4440.0404 {space 3} {res}  1135.836  
{txt}        14{c |} {space 3} {res} 8975.8656 {space 3} {res} 3792.7368 {space 3} {res} 974.00243  
{txt}        15{c |} {space 3} {res} 8178.4744 {space 3} {res} 3245.1003 {space 3} {res} 846.71514  
{txt}        16{c |} {space 3} {res} 7451.9213 {space 3} {res} 2784.0987 {space 3} {res}  739.5864  
{txt}        17{c |} {space 3} {res} 6789.9131 {space 3} {res} 2399.2025 {space 3} {res} 650.14159  
{txt}        18{c |} {space 3} {res}  6186.716 {space 3} {res} 2077.6828 {space 3} {res} 575.22206  
{txt}        19{c |} {space 3} {res} 5637.1052 {space 3} {res} 1808.9545 {space 3} {res} 512.22553  
{txt}        20{c |} {space 3} {res} 5136.3203 {space 3} {res} 1584.2142 {space 3} {res} 459.01598  
{txt}        21{c |} {space 3} {res} 4680.0237 {space 3} {res} 1396.1389 {space 3} {res} 413.84709  
{txt}        22{c |} {space 3} {res} 4264.2633 {space 3} {res} 1238.6362 {space 3} {res} 375.29686  
{txt}        23{c |} {space 3} {res} 3885.4379 {space 3} {res} 1106.6361 {space 3} {res} 342.21155  
{txt}        24{c |} {space 3} {res} 3540.2663 {space 3} {res} 995.91868 {space 3} {res} 313.65775  
{txt}        25{c |} {space 3} {res} 3225.7588 {space 3} {res} 902.97087 {space 3} {res} 288.88156  
{txt}        26{c |} {space 3} {res} 2939.1913 {space 3} {res} 825.34561 {space 3} {res} 267.17892  
{txt}        27{c |} {space 3} {res} 2678.0817 {space 3} {res} 760.38714 {space 3} {res} 248.10453  
{txt}        28{c |} {space 3} {res} 2440.1683 {space 3} {res} 703.31872 {space 3} {res} 230.76798  
{txt}        29{c |} {space 3} {res} 2223.3904 {space 3} {res} 654.06491 {space 3} {res} 214.98796  
{txt}        30{c |} {space 3} {res} 2025.8706 {space 3} {res} 611.52854 {space 3} {res} 200.84841  
{txt}        31{c |} {space 3} {res} 1845.8978 {space 3} {res} 575.54121 {space 3} {res} 188.40654  
{txt}        32{c |} {space 3} {res} 1681.9133 {space 3} {res} 545.05078 {space 3} {res} 177.45417  
{txt}        33{c |} {space 3} {res} 1532.4968 {space 3} {res} 519.17845 {space 3} {res} 167.81145  
{txt}        34{c |} {space 3} {res}  1396.354 {space 3} {res} 497.18977 {space 3} {res} 159.32199  
{txt}        35{c |} {space 3} {res} 1272.3058 {space 3} {res} 478.47059 {space 3} {res} 151.84907  ^
{txt}        36{c |} {space 3} {res} 1159.2776 {space 3} {res}   462.507 {space 3} {res} 145.27259  
{txt}        37{c |} {space 3} {res} 1056.2906 {space 3} {res}  448.8687 {space 3} {res} 139.48664  
{txt}        38{c |} {space 3} {res} 962.45264 {space 3} {res}  437.1951 {space 3} {res} 134.39758  
{txt}        39{c |} {space 3} {res}   876.951 {space 3} {res}  427.1838 {space 3} {res} 129.92244  
{txt}        40{c |} {space 3} {res} 799.04509 {space 3} {res} 418.58096 {space 3} {res}  125.9877  
{txt}        41{c |} {space 3} {res} 728.06013 {space 3} {res} 411.17333 {space 3} {res} 122.52817  
{txt}        42{c |} {space 3} {res} 663.38127 {space 3} {res} 404.78156 {space 3} {res} 119.48615  
{txt}        43{c |} {space 3} {res} 604.44831 {space 3} {res} 399.25467 {space 3} {res} 116.81057  
{txt}        44{c |} {space 3} {res} 550.75079 {space 3} {res} 394.46537 {space 3} {res} 114.45638  
{txt}        45{c |} {space 3} {res} 501.82361 {space 3} {res} 390.30629 {space 3} {res} 112.38385  
{txt}        46{c |} {space 3} {res} 457.24298 {space 3} {res} 386.68666 {space 3} {res} 110.55804  
{txt}        47{c |} {space 3} {res} 416.62277 {space 3} {res} 383.52972 {space 3} {res}  108.9483  
{txt}        48{c |} {space 3} {res} 379.61115 {space 3} {res} 380.77038 {space 3} {res} 107.52773  
{txt}        49{c |} {space 3} {res} 345.88755 {space 3} {res} 378.35345 {space 3} {res} 106.27284  
{txt}        50{c |} {space 3} {res} 315.15985 {space 3} {res} 377.24088 {space 3} {res} 105.38259  *
{txt}        51{c |} {space 3} {res} 287.16192 {space 3} {res} 382.01408 {space 3} {res} 105.95963  
{txt}        52{c |} {space 3} {res} 261.65124 {space 3} {res} 389.65489 {space 3} {res}  107.7111  
{txt}        53{c |} {space 3} {res} 238.40687 {space 3} {res} 396.94246 {space 3} {res} 110.12192  
{txt}        54{c |} {space 3} {res} 217.22746 {space 3} {res} 398.32045 {space 3} {res}  111.7516  
{txt}        55{c |} {space 3} {res} 197.92957 {space 3} {res} 399.72318 {space 3} {res} 113.59134  
{txt}        56{c |} {space 3} {res} 180.34605 {space 3} {res} 401.75368 {space 3} {res} 115.49682  
{txt}        57{c |} {space 3} {res} 164.32461 {space 3} {res} 404.46026 {space 3} {res}  117.3465  
{txt}        58{c |} {space 3} {res} 149.72646 {space 3} {res} 405.28304 {space 3} {res} 118.73463  
{txt}        59{c |} {space 3} {res} 136.42518 {space 3} {res}  405.2511 {space 3} {res}  120.1721  
{txt}        60{c |} {space 3} {res} 124.30554 {space 3} {res}  405.2761 {space 3} {res} 121.62263  
{txt}        61{c |} {space 3} {res} 113.26258 {space 3} {res} 403.59011 {space 3} {res} 122.41581  
{txt}        62{c |} {space 3} {res} 103.20064 {space 3} {res} 401.82587 {space 3} {res} 122.98928  
{txt}        63{c |} {space 3} {res} 94.032582 {space 3} {res} 402.94599 {space 3} {res} 124.26148  
{txt}        64{c |} {space 3} {res} 85.678986 {space 3} {res} 404.20592 {space 3} {res} 125.21789  
{txt}        65{c |} {space 3} {res} 78.067501 {space 3} {res} 403.68408 {space 3} {res} 125.62712  
{txt}        66{c |} {space 3} {res}   71.1322 {space 3} {res} 400.91215 {space 3} {res} 125.64499  
{txt}        67{c |} {space 3} {res} 64.813011 {space 3} {res}  398.9517 {space 3} {res} 126.02457  
{txt}        68{c |} {space 3} {res} 59.055202 {space 3} {res} 397.76927 {space 3} {res} 126.60418  
{txt}        69{c |} {space 3} {res}   53.8089 {space 3} {res} 396.84309 {space 3} {res} 127.16789  
{txt}        70{c |} {space 3} {res} 49.028666 {space 3} {res} 395.36465 {space 3} {res} 127.77929  
{txt}        71{c |} {space 3} {res} 44.673094 {space 3} {res} 392.86311 {space 3} {res} 128.06788  
{txt}        72{c |} {space 3} {res}  40.70446 {space 3} {res} 391.49788 {space 3} {res} 128.48992  
{txt}        73{c |} {space 3} {res} 37.088388 {space 3} {res} 391.07007 {space 3} {res} 129.00451  
{txt}        74{c |} {space 3} {res} 33.793558 {space 3} {res} 392.16177 {space 3} {res} 129.49754  
{txt}        75{c |} {space 3} {res} 30.791431 {space 3} {res} 395.08297 {space 3} {res} 129.54637  
{txt}        76{c |} {space 3} {res} 28.056005 {space 3} {res} 398.32513 {space 3} {res} 129.52706  
{txt}        77{c |} {space 3} {res} 25.563587 {space 3} {res} 401.15399 {space 3} {res} 129.44648  
{txt}        78{c |} {space 3} {res} 23.292588 {space 3} {res} 403.24593 {space 3} {res} 129.10851  
{txt}        79{c |} {space 3} {res} 21.223339 {space 3} {res} 405.54289 {space 3} {res} 128.94792  
{txt}        80{c |} {space 3} {res} 19.337916 {space 3} {res} 409.33005 {space 3} {res} 129.52204  
{txt}        81{c |} {space 3} {res} 17.619989 {space 3} {res} 414.58054 {space 3} {res} 130.50225  
{txt}        82{c |} {space 3} {res} 16.054678 {space 3} {res} 423.29174 {space 3} {res} 131.10197  
{txt}        83{c |} {space 3} {res} 14.628424 {space 3} {res} 431.51624 {space 3} {res} 130.67818  
{txt}        84{c |} {space 3} {res} 13.328875 {space 3} {res} 436.86415 {space 3} {res} 129.31034  
{txt}        85{c |} {space 3} {res} 12.144775 {space 3} {res} 440.37741 {space 3} {res} 128.09369  
{txt}        86{c |} {space 3} {res} 11.065867 {space 3} {res} 442.49849 {space 3} {res} 127.09852  
{txt}        87{c |} {space 3} {res} 10.082806 {space 3} {res} 444.85132 {space 3} {res} 126.41494  
{txt}        88{c |} {space 3} {res} 9.1870769 {space 3} {res} 447.34397 {space 3} {res} 125.97551  
{txt}        89{c |} {space 3} {res} 8.3709223 {space 3} {res}  449.9048 {space 3} {res} 125.72547  
{txt}        90{c |} {space 3} {res} 7.6272726 {space 3} {res} 452.47857 {space 3} {res} 125.62067  
{txt}        91{c |} {space 3} {res} 6.9496867 {space 3} {res} 455.02332 {space 3} {res} 125.62572  
{txt}        92{c |} {space 3} {res} 6.3322957 {space 3} {res} 457.50773 {space 3} {res} 125.71243  
{txt}        93{c |} {space 3} {res}  5.769752 {space 3} {res} 459.90901 {space 3} {res} 125.85849  
{txt}        94{c |} {space 3} {res} 5.2571831 {space 3} {res} 462.21121 {space 3} {res} 126.04634  
{txt}        95{c |} {space 3} {res} 4.7901495 {space 3} {res} 464.40372 {space 3} {res} 126.26225  
{txt}        96{c |} {space 3} {res} 4.3646058 {space 3} {res} 466.48019 {space 3} {res} 126.49555  
{txt}        97{c |} {space 3} {res} 3.9768663 {space 3} {res} 468.43756 {space 3} {res} 126.73804  
{txt}        98{c |} {space 3} {res} 3.6235724 {space 3} {res} 470.27531 {space 3} {res} 126.98348  
{txt}        99{c |} {space 3} {res} 3.3016642 {space 3} {res} 471.99485 {space 3} {res} 127.22718  
{txt}       100{c |} {space 3} {res} 3.0083535 {space 3} {res} 473.59904 {space 3} {res} 127.46568  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=12.01 9:09:12

{com}. // we should have 144-130-1=14 folds
. assert 13==`e(nfolds)'
{txt}r; t=0.00 9:09:12

{com}. 
. cvlasso air L(1/12).air, rolling origin(130) fixedwin
{txt}Rolling forecasting cross-validation with 1-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (131), 14-131 (132), 15-132 (133), 16-133 (134), 17-134 (135), 18-135 (136), 19-136 (137), 20-137 (138), 21-138 (139), 22-139 (140), 23-140 (141), 24-141 (142), 25-142 (143), 26-143 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 30083.535 {space 3} {res} 29342.536 {space 3} {res} 7604.6329  
{txt}         2{c |} {space 3} {res} 27410.996 {space 3} {res} 24556.677 {space 3} {res} 6355.4314  
{txt}         3{c |} {space 3} {res} 24975.879 {space 3} {res}  20570.95 {space 3} {res} 5316.2899  
{txt}         4{c |} {space 3} {res} 22757.091 {space 3} {res} 17250.611 {space 3} {res} 4451.7039  
{txt}         5{c |} {space 3} {res} 20735.414 {space 3} {res} 14483.694 {space 3} {res} 3732.1806  
{txt}         6{c |} {space 3} {res} 18893.337 {space 3} {res} 12177.154 {space 3} {res} 3133.2195  
{txt}         7{c |} {space 3} {res} 17214.905 {space 3} {res} 10253.662 {space 3} {res}  2634.466  
{txt}         8{c |} {space 3} {res}  15685.58 {space 3} {res} 8648.9434 {space 3} {res} 2219.0087  
{txt}         9{c |} {space 3} {res} 14292.116 {space 3} {res} 7309.5692 {space 3} {res} 1872.7961  
{txt}        10{c |} {space 3} {res} 13022.444 {space 3} {res} 6191.1202 {space 3} {res} 1584.1517  
{txt}        11{c |} {space 3} {res} 11865.566 {space 3} {res} 5256.6626 {space 3} {res} 1343.3724  
{txt}        12{c |} {space 3} {res} 10811.462 {space 3} {res} 4475.4822 {space 3} {res} 1142.3943  
{txt}        13{c |} {space 3} {res} 9851.0014 {space 3} {res} 3822.0328 {space 3} {res} 974.51561  
{txt}        14{c |} {space 3} {res} 8975.8656 {space 3} {res} 3272.4349 {space 3} {res} 844.16278  
{txt}        15{c |} {space 3} {res} 8178.4744 {space 3} {res} 2805.5335 {space 3} {res} 735.84716  
{txt}        16{c |} {space 3} {res} 7451.9213 {space 3} {res} 2415.5597 {space 3} {res}  645.3886  
{txt}        17{c |} {space 3} {res} 6789.9131 {space 3} {res} 2089.5994 {space 3} {res} 569.63807  
{txt}        18{c |} {space 3} {res}  6186.716 {space 3} {res} 1816.9795 {space 3} {res} 505.97842  
{txt}        19{c |} {space 3} {res} 5637.1052 {space 3} {res} 1588.8216 {space 3} {res} 452.25745  
{txt}        20{c |} {space 3} {res} 5136.3203 {space 3} {res} 1397.7387 {space 3} {res}  406.7116  
{txt}        21{c |} {space 3} {res} 4680.0237 {space 3} {res}  1237.584 {space 3} {res} 367.90116  
{txt}        22{c |} {space 3} {res} 4264.2633 {space 3} {res} 1103.2409 {space 3} {res} 334.65486  
{txt}        23{c |} {space 3} {res} 3885.4379 {space 3} {res} 990.44955 {space 3} {res} 306.02247  
{txt}        24{c |} {space 3} {res} 3540.2663 {space 3} {res}  895.6626 {space 3} {res} 281.23456  
{txt}        25{c |} {space 3} {res} 3225.7588 {space 3} {res} 816.25649 {space 3} {res} 259.59417  
{txt}        26{c |} {space 3} {res} 2939.1913 {space 3} {res} 750.07662 {space 3} {res} 240.58066  
{txt}        27{c |} {space 3} {res} 2678.0817 {space 3} {res} 693.47635 {space 3} {res} 223.73861  
{txt}        28{c |} {space 3} {res} 2440.1683 {space 3} {res} 643.46868 {space 3} {res} 208.49267  
{txt}        29{c |} {space 3} {res} 2223.3904 {space 3} {res}  599.2883 {space 3} {res}  194.5465  
{txt}        30{c |} {space 3} {res} 2025.8706 {space 3} {res} 561.87629 {space 3} {res} 182.29443  
{txt}        31{c |} {space 3} {res} 1845.8978 {space 3} {res}  530.1486 {space 3} {res} 171.52546  
{txt}        32{c |} {space 3} {res} 1681.9133 {space 3} {res} 503.19944 {space 3} {res} 162.05771  
{txt}        33{c |} {space 3} {res} 1532.4968 {space 3} {res} 480.27153 {space 3} {res} 153.73349  
{txt}        34{c |} {space 3} {res}  1396.354 {space 3} {res} 460.73137 {space 3} {res} 146.41531  
{txt}        35{c |} {space 3} {res} 1272.3058 {space 3} {res} 444.04865 {space 3} {res} 139.98272  ^
{txt}        36{c |} {space 3} {res} 1159.2776 {space 3} {res}  429.7791 {space 3} {res} 134.32978  
{txt}        37{c |} {space 3} {res} 1056.2906 {space 3} {res} 417.55025 {space 3} {res} 129.36305  
{txt}        38{c |} {space 3} {res} 962.45264 {space 3} {res} 407.04957 {space 3} {res} 124.99996  
{txt}        39{c |} {space 3} {res}   876.951 {space 3} {res} 398.01456 {space 3} {res} 121.16748  
{txt}        40{c |} {space 3} {res} 799.04509 {space 3} {res} 390.22455 {space 3} {res} 117.80101  
{txt}        41{c |} {space 3} {res} 728.06013 {space 3} {res} 383.49384 {space 3} {res} 114.84345  
{txt}        42{c |} {space 3} {res} 663.38127 {space 3} {res} 377.66597 {space 3} {res}  112.2444  
{txt}        43{c |} {space 3} {res} 604.44831 {space 3} {res} 372.60897 {space 3} {res} 109.95941  
{txt}        44{c |} {space 3} {res} 550.75079 {space 3} {res} 368.21137 {space 3} {res} 107.94939  
{txt}        45{c |} {space 3} {res} 501.82361 {space 3} {res} 364.37892 {space 3} {res} 106.17998  
{txt}        46{c |} {space 3} {res} 457.24298 {space 3} {res} 361.03178 {space 3} {res} 104.62109  
{txt}        47{c |} {space 3} {res} 416.62277 {space 3} {res} 358.10226 {space 3} {res} 103.24635  
{txt}        48{c |} {space 3} {res} 379.61115 {space 3} {res} 355.53282 {space 3} {res} 102.03273  
{txt}        49{c |} {space 3} {res} 345.88755 {space 3} {res} 353.27454 {space 3} {res} 100.96014  *
{txt}        50{c |} {space 3} {res} 315.15985 {space 3} {res} 353.56351 {space 3} {res} 100.54566  
{txt}        51{c |} {space 3} {res} 287.16192 {space 3} {res} 358.15619 {space 3} {res} 101.22159  
{txt}        52{c |} {space 3} {res} 261.65124 {space 3} {res} 365.35705 {space 3} {res} 102.96975  
{txt}        53{c |} {space 3} {res} 238.40687 {space 3} {res} 369.66508 {space 3} {res} 104.79961  
{txt}        54{c |} {space 3} {res} 217.22746 {space 3} {res} 370.95016 {space 3} {res} 106.38565  
{txt}        55{c |} {space 3} {res} 197.92957 {space 3} {res} 372.74966 {space 3} {res} 108.15476  
{txt}        56{c |} {space 3} {res} 180.34605 {space 3} {res} 375.87984 {space 3} {res} 109.75375  
{txt}        57{c |} {space 3} {res} 164.32461 {space 3} {res} 378.13286 {space 3} {res} 111.19205  
{txt}        58{c |} {space 3} {res} 149.72646 {space 3} {res} 379.31752 {space 3} {res} 112.39925  
{txt}        59{c |} {space 3} {res} 136.42518 {space 3} {res} 379.96884 {space 3} {res} 113.65128  
{txt}        60{c |} {space 3} {res} 124.30554 {space 3} {res} 379.47216 {space 3} {res} 114.64207  
{txt}        61{c |} {space 3} {res} 113.26258 {space 3} {res}  378.6107 {space 3} {res}  115.2831  
{txt}        62{c |} {space 3} {res} 103.20064 {space 3} {res} 379.47067 {space 3} {res} 116.07434  
{txt}        63{c |} {space 3} {res} 94.032582 {space 3} {res} 380.87369 {space 3} {res} 116.91882  
{txt}        64{c |} {space 3} {res} 85.678986 {space 3} {res} 382.03715 {space 3} {res} 117.67983  
{txt}        65{c |} {space 3} {res} 78.067501 {space 3} {res} 380.53668 {space 3} {res} 118.00548  
{txt}        66{c |} {space 3} {res}   71.1322 {space 3} {res}   377.904 {space 3} {res}  117.9601  
{txt}        67{c |} {space 3} {res} 64.813011 {space 3} {res} 376.68599 {space 3} {res} 118.51554  
{txt}        68{c |} {space 3} {res} 59.055202 {space 3} {res} 376.04184 {space 3} {res}  118.9979  
{txt}        69{c |} {space 3} {res}   53.8089 {space 3} {res} 375.66725 {space 3} {res} 119.47501  
{txt}        70{c |} {space 3} {res} 49.028666 {space 3} {res} 374.18355 {space 3} {res} 120.01102  
{txt}        71{c |} {space 3} {res} 44.673094 {space 3} {res} 372.68744 {space 3} {res} 120.23184  
{txt}        72{c |} {space 3} {res}  40.70446 {space 3} {res} 372.63602 {space 3} {res} 120.62715  
{txt}        73{c |} {space 3} {res} 37.088388 {space 3} {res} 372.96002 {space 3} {res} 120.98856  
{txt}        74{c |} {space 3} {res} 33.793558 {space 3} {res} 375.67225 {space 3} {res}  121.2765  
{txt}        75{c |} {space 3} {res} 30.791431 {space 3} {res} 379.83266 {space 3} {res} 121.13771  
{txt}        76{c |} {space 3} {res} 28.056005 {space 3} {res} 383.96921 {space 3} {res} 121.02467  
{txt}        77{c |} {space 3} {res} 25.563587 {space 3} {res} 387.82565 {space 3} {res} 120.59418  
{txt}        78{c |} {space 3} {res} 23.292588 {space 3} {res} 391.20473 {space 3} {res} 120.20296  
{txt}        79{c |} {space 3} {res} 21.223339 {space 3} {res} 395.06233 {space 3} {res} 120.19574  
{txt}        80{c |} {space 3} {res} 19.337916 {space 3} {res} 400.12432 {space 3} {res} 120.81217  
{txt}        81{c |} {space 3} {res} 17.619989 {space 3} {res}  408.9831 {space 3} {res} 121.88139  
{txt}        82{c |} {space 3} {res} 16.054678 {space 3} {res} 419.70456 {space 3} {res} 122.19761  
{txt}        83{c |} {space 3} {res} 14.628424 {space 3} {res} 427.29042 {space 3} {res} 121.84983  
{txt}        84{c |} {space 3} {res} 13.328875 {space 3} {res} 432.32449 {space 3} {res} 120.51138  
{txt}        85{c |} {space 3} {res} 12.144775 {space 3} {res} 434.70003 {space 3} {res} 119.27437  
{txt}        86{c |} {space 3} {res} 11.065867 {space 3} {res} 437.29344 {space 3} {res}  118.3797  
{txt}        87{c |} {space 3} {res} 10.082806 {space 3} {res} 440.01255 {space 3} {res} 117.75625  
{txt}        88{c |} {space 3} {res} 9.1870769 {space 3} {res} 442.78574 {space 3} {res} 117.34583  
{txt}        89{c |} {space 3} {res} 8.3709223 {space 3} {res} 445.55799 {space 3} {res} 117.10114  
{txt}        90{c |} {space 3} {res} 7.6272726 {space 3} {res} 448.28774 {space 3} {res} 116.98402  
{txt}        91{c |} {space 3} {res} 6.9496867 {space 3} {res} 450.94415 {space 3} {res} 116.96386  
{txt}        92{c |} {space 3} {res} 6.3322957 {space 3} {res} 453.50503 {space 3} {res} 117.01624  
{txt}        93{c |} {space 3} {res}  5.769752 {space 3} {res}   455.955 {space 3} {res} 117.12177  
{txt}        94{c |} {space 3} {res} 5.2571831 {space 3} {res} 458.28413 {space 3} {res} 117.26519  
{txt}        95{c |} {space 3} {res} 4.7901495 {space 3} {res} 460.48672 {space 3} {res} 117.43449  
{txt}        96{c |} {space 3} {res} 4.3646058 {space 3} {res} 462.56036 {space 3} {res} 117.62036  
{txt}        97{c |} {space 3} {res} 3.9768663 {space 3} {res} 464.50518 {space 3} {res} 117.81559  
{txt}        98{c |} {space 3} {res} 3.6235724 {space 3} {res} 466.32322 {space 3} {res} 118.01467  
{txt}        99{c |} {space 3} {res} 3.3016642 {space 3} {res} 468.01793 {space 3} {res} 118.21343  
{txt}       100{c |} {space 3} {res} 3.0083535 {space 3} {res} 469.59378 {space 3} {res} 118.40879  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=13.06 9:09:25

{com}. assert 14==`e(nfolds)'
{txt}r; t=0.00 9:09:25

{com}. 
. ********************************************************************************
. *** panel example
. ********************************************************************************
. 
. use "http://fmwww.bc.edu/ec-p/data/macro/abdata.dta", clear
{txt}(Layard & Nickell, Unemployment in Britain, Economica 53, 1986 from Ox dist)
r; t=0.45 9:09:25

{com}. 
. // FE and noftools options
. cvlasso ys l(0/3).k l(0/3).n, fe seed(123)

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 46.945458 {space 3} {res} .00843492 {space 3} {res} .00058496  
{txt}         2{c |} {space 3} {res} 42.774952 {space 3} {res} .00813196 {space 3} {res}  .0005897  
{txt}         3{c |} {space 3} {res} 38.974944 {space 3} {res} .00773276 {space 3} {res} .00056315  
{txt}         4{c |} {space 3} {res} 35.512517 {space 3} {res} .00737473 {space 3} {res} .00053581  
{txt}         5{c |} {space 3} {res} 32.357683 {space 3} {res} .00706573 {space 3} {res}  .0005092  
{txt}         6{c |} {space 3} {res} 29.483116 {space 3} {res}  .0068078 {space 3} {res}  .0004852  
{txt}         7{c |} {space 3} {res} 26.863917 {space 3} {res} .00659238 {space 3} {res}  .0004636  
{txt}         8{c |} {space 3} {res}   24.4774 {space 3} {res} .00641237 {space 3} {res} .00044421  
{txt}         9{c |} {space 3} {res} 22.302896 {space 3} {res} .00626186 {space 3} {res} .00042685  
{txt}        10{c |} {space 3} {res} 20.321568 {space 3} {res} .00613594 {space 3} {res} .00041134  
{txt}        11{c |} {space 3} {res} 18.516256 {space 3} {res} .00603053 {space 3} {res} .00039754  
{txt}        12{c |} {space 3} {res} 16.871323 {space 3} {res}  .0059422 {space 3} {res} .00038527  
{txt}        13{c |} {space 3} {res} 15.372521 {space 3} {res} .00586815 {space 3} {res} .00037439  
{txt}        14{c |} {space 3} {res} 14.006868 {space 3} {res} .00580767 {space 3} {res} .00036394  
{txt}        15{c |} {space 3} {res} 12.762537 {space 3} {res} .00575894 {space 3} {res} .00035376  
{txt}        16{c |} {space 3} {res} 11.628748 {space 3} {res} .00571635 {space 3} {res} .00034367  
{txt}        17{c |} {space 3} {res} 10.595682 {space 3} {res} .00567365 {space 3} {res} .00033312  
{txt}        18{c |} {space 3} {res} 9.6543911 {space 3} {res} .00563169 {space 3} {res} .00032285  
{txt}        19{c |} {space 3} {res} 8.7967216 {space 3} {res} .00558916 {space 3} {res} .00031273  ^
{txt}        20{c |} {space 3} {res} 8.0152451 {space 3} {res} .00555189 {space 3} {res} .00030398  
{txt}        21{c |} {space 3} {res} 7.3031928 {space 3} {res} .00551614 {space 3} {res} .00029582  
{txt}        22{c |} {space 3} {res} 6.6543973 {space 3} {res}  .0054842 {space 3} {res} .00028853  
{txt}        23{c |} {space 3} {res}  6.063239 {space 3} {res} .00545554 {space 3} {res} .00028109  
{txt}        24{c |} {space 3} {res} 5.5245976 {space 3} {res} .00543376 {space 3} {res} .00027373  
{txt}        25{c |} {space 3} {res} 5.0338075 {space 3} {res} .00541646 {space 3} {res} .00026706  
{txt}        26{c |} {space 3} {res} 4.5866179 {space 3} {res} .00540234 {space 3} {res} .00026121  
{txt}        27{c |} {space 3} {res} 4.1791554 {space 3} {res} .00539083 {space 3} {res} .00025608  
{txt}        28{c |} {space 3} {res} 3.8078908 {space 3} {res} .00538147 {space 3} {res} .00025161  
{txt}        29{c |} {space 3} {res} 3.4696083 {space 3} {res} .00537447 {space 3} {res} .00024786  
{txt}        30{c |} {space 3} {res} 3.1613778 {space 3} {res} .00536953 {space 3} {res} .00024474  
{txt}        31{c |} {space 3} {res} 2.8805297 {space 3} {res} .00536569 {space 3} {res} .00024204  
{txt}        32{c |} {space 3} {res} 2.6246314 {space 3} {res} .00536274 {space 3} {res}  .0002397  
{txt}        33{c |} {space 3} {res} 2.3914664 {space 3} {res} .00536129 {space 3} {res} .00023773  
{txt}        34{c |} {space 3} {res} 2.1790151 {space 3} {res}  .0053607 {space 3} {res} .00023603  
{txt}        35{c |} {space 3} {res} 1.9854374 {space 3} {res} .00536049 {space 3} {res} .00023456  *
{txt}        36{c |} {space 3} {res} 1.8090566 {space 3} {res}  .0053616 {space 3} {res} .00023354  
{txt}        37{c |} {space 3} {res}  1.648345 {space 3} {res} .00536378 {space 3} {res} .00023229  
{txt}        38{c |} {space 3} {res} 1.5019106 {space 3} {res} .00536851 {space 3} {res} .00023011  
{txt}        39{c |} {space 3} {res}  1.368485 {space 3} {res}  .0053741 {space 3} {res} .00022843  
{txt}        40{c |} {space 3} {res} 1.2469126 {space 3} {res} .00537969 {space 3} {res} .00022697  
{txt}        41{c |} {space 3} {res} 1.1361403 {space 3} {res} .00538588 {space 3} {res} .00022581  
{txt}        42{c |} {space 3} {res} 1.0352087 {space 3} {res} .00539219 {space 3} {res} .00022482  
{txt}        43{c |} {space 3} {res} .94324363 {space 3} {res} .00539811 {space 3} {res} .00022394  
{txt}        44{c |} {space 3} {res} .85944846 {space 3} {res} .00540365 {space 3} {res} .00022315  
{txt}        45{c |} {space 3} {res} .78309743 {space 3} {res} .00540967 {space 3} {res} .00022263  
{txt}        46{c |} {space 3} {res} .71352921 {space 3} {res}  .0054163 {space 3} {res} .00022214  
{txt}        47{c |} {space 3} {res} .65014124 {space 3} {res} .00542284 {space 3} {res} .00022161  
{txt}        48{c |} {space 3} {res} .59238449 {space 3} {res} .00542906 {space 3} {res} .00022113  
{txt}        49{c |} {space 3} {res} .53975868 {space 3} {res} .00543495 {space 3} {res} .00022071  
{txt}        50{c |} {space 3} {res} .49180801 {space 3} {res} .00544044 {space 3} {res} .00022032  
{txt}        51{c |} {space 3} {res} .44811714 {space 3} {res} .00544564 {space 3} {res} .00021997  
{txt}        52{c |} {space 3} {res} .40830765 {space 3} {res} .00545058 {space 3} {res} .00021961  
{txt}        53{c |} {space 3} {res} .37203472 {space 3} {res}   .005455 {space 3} {res} .00021921  
{txt}        54{c |} {space 3} {res} .33898418 {space 3} {res} .00545904 {space 3} {res} .00021881  
{txt}        55{c |} {space 3} {res} .30886976 {space 3} {res}  .0054628 {space 3} {res} .00021846  
{txt}        56{c |} {space 3} {res} .28143062 {space 3} {res}  .0054662 {space 3} {res} .00021811  
{txt}        57{c |} {space 3} {res}  .2564291 {space 3} {res} .00546937 {space 3} {res} .00021779  
{txt}        58{c |} {space 3} {res} .23364865 {space 3} {res} .00547234 {space 3} {res} .00021749  
{txt}        59{c |} {space 3} {res} .21289195 {space 3} {res} .00547504 {space 3} {res} .00021723  
{txt}        60{c |} {space 3} {res} .19397921 {space 3} {res} .00547749 {space 3} {res}   .000217  
{txt}        61{c |} {space 3} {res} .17674663 {space 3} {res} .00547977 {space 3} {res}  .0002168  
{txt}        62{c |} {space 3} {res} .16104495 {space 3} {res} .00548186 {space 3} {res} .00021661  
{txt}        63{c |} {space 3} {res} .14673816 {space 3} {res} .00548379 {space 3} {res} .00021644  
{txt}        64{c |} {space 3} {res} .13370235 {space 3} {res} .00548546 {space 3} {res} .00021627  
{txt}        65{c |} {space 3} {res}  .1218246 {space 3} {res} .00548693 {space 3} {res} .00021611  
{txt}        66{c |} {space 3} {res} .11100204 {space 3} {res}  .0054883 {space 3} {res} .00021597  
{txt}        67{c |} {space 3} {res} .10114092 {space 3} {res} .00548956 {space 3} {res} .00021584  
{txt}        68{c |} {space 3} {res} .09215584 {space 3} {res}  .0054907 {space 3} {res} .00021572  
{txt}        69{c |} {space 3} {res} .08396897 {space 3} {res} .00549175 {space 3} {res} .00021561  
{txt}        70{c |} {space 3} {res}  .0765094 {space 3} {res} .00549272 {space 3} {res} .00021552  
{txt}        71{c |} {space 3} {res} .06971251 {space 3} {res}  .0054936 {space 3} {res} .00021543  
{txt}        72{c |} {space 3} {res} .06351945 {space 3} {res}  .0054944 {space 3} {res} .00021535  
{txt}        73{c |} {space 3} {res} .05787655 {space 3} {res} .00549514 {space 3} {res} .00021528  
{txt}        74{c |} {space 3} {res} .05273496 {space 3} {res} .00549581 {space 3} {res} .00021521  
{txt}        75{c |} {space 3} {res} .04805013 {space 3} {res} .00549642 {space 3} {res} .00021515  
{txt}        76{c |} {space 3} {res} .04378149 {space 3} {res} .00549698 {space 3} {res}  .0002151  
{txt}        77{c |} {space 3} {res} .03989206 {space 3} {res}  .0054975 {space 3} {res} .00021505  
{txt}        78{c |} {space 3} {res} .03634816 {space 3} {res} .00549796 {space 3} {res}   .000215  
{txt}        79{c |} {space 3} {res} .03311909 {space 3} {res} .00549839 {space 3} {res} .00021496  
{txt}        80{c |} {space 3} {res} .03017688 {space 3} {res} .00549878 {space 3} {res} .00021493  
{txt}        81{c |} {space 3} {res} .02749605 {space 3} {res} .00549914 {space 3} {res} .00021489  
{txt}        82{c |} {space 3} {res} .02505338 {space 3} {res} .00549946 {space 3} {res} .00021486  
{txt}        83{c |} {space 3} {res} .02282771 {space 3} {res} .00549976 {space 3} {res} .00021483  
{txt}        84{c |} {space 3} {res} .02079976 {space 3} {res} .00550003 {space 3} {res} .00021481  
{txt}        85{c |} {space 3} {res} .01895196 {space 3} {res} .00550027 {space 3} {res} .00021478  
{txt}        86{c |} {space 3} {res} .01726832 {space 3} {res}  .0055005 {space 3} {res} .00021476  
{txt}        87{c |} {space 3} {res} .01573425 {space 3} {res}  .0055007 {space 3} {res} .00021474  
{txt}        88{c |} {space 3} {res} .01433646 {space 3} {res} .00550089 {space 3} {res} .00021472  
{txt}        89{c |} {space 3} {res} .01306285 {space 3} {res} .00550106 {space 3} {res} .00021471  
{txt}        90{c |} {space 3} {res} .01190238 {space 3} {res} .00550121 {space 3} {res} .00021469  
{txt}        91{c |} {space 3} {res} .01084501 {space 3} {res} .00550136 {space 3} {res} .00021468  
{txt}        92{c |} {space 3} {res} .00988157 {space 3} {res} .00550148 {space 3} {res} .00021467  
{txt}        93{c |} {space 3} {res} .00900372 {space 3} {res}  .0055016 {space 3} {res} .00021466  
{txt}        94{c |} {space 3} {res} .00820385 {space 3} {res} .00550171 {space 3} {res} .00021465  
{txt}        95{c |} {space 3} {res} .00747504 {space 3} {res} .00550181 {space 3} {res} .00021464  
{txt}        96{c |} {space 3} {res} .00681098 {space 3} {res}  .0055019 {space 3} {res} .00021463  
{txt}        97{c |} {space 3} {res} .00620591 {space 3} {res} .00550198 {space 3} {res} .00021462  
{txt}        98{c |} {space 3} {res}  .0056546 {space 3} {res} .00550205 {space 3} {res} .00021461  
{txt}        99{c |} {space 3} {res} .00515226 {space 3} {res} .00550212 {space 3} {res} .00021461  
{txt}       100{c |} {space 3} {res} .00469455 {space 3} {res} .00550218 {space 3} {res}  .0002146  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=1.15 9:09:27

{com}. savedresults save ftools e()
{txt}r; t=0.00 9:09:27

{com}. cap noi assert "`e(noftools)'"==""  // will be error if ftools not installed
{txt}r; t=0.00 9:09:27

{com}. cvlasso ys l(0/3).k l(0/3).n, fe seed(123) noftools

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 46.945458 {space 3} {res} .00843492 {space 3} {res} .00058496  
{txt}         2{c |} {space 3} {res} 42.774952 {space 3} {res} .00813196 {space 3} {res}  .0005897  
{txt}         3{c |} {space 3} {res} 38.974944 {space 3} {res} .00773276 {space 3} {res} .00056315  
{txt}         4{c |} {space 3} {res} 35.512517 {space 3} {res} .00737473 {space 3} {res} .00053581  
{txt}         5{c |} {space 3} {res} 32.357683 {space 3} {res} .00706573 {space 3} {res}  .0005092  
{txt}         6{c |} {space 3} {res} 29.483116 {space 3} {res}  .0068078 {space 3} {res}  .0004852  
{txt}         7{c |} {space 3} {res} 26.863917 {space 3} {res} .00659238 {space 3} {res}  .0004636  
{txt}         8{c |} {space 3} {res}   24.4774 {space 3} {res} .00641237 {space 3} {res} .00044421  
{txt}         9{c |} {space 3} {res} 22.302896 {space 3} {res} .00626186 {space 3} {res} .00042685  
{txt}        10{c |} {space 3} {res} 20.321568 {space 3} {res} .00613594 {space 3} {res} .00041134  
{txt}        11{c |} {space 3} {res} 18.516256 {space 3} {res} .00603053 {space 3} {res} .00039754  
{txt}        12{c |} {space 3} {res} 16.871323 {space 3} {res}  .0059422 {space 3} {res} .00038527  
{txt}        13{c |} {space 3} {res} 15.372521 {space 3} {res} .00586815 {space 3} {res} .00037439  
{txt}        14{c |} {space 3} {res} 14.006868 {space 3} {res} .00580767 {space 3} {res} .00036394  
{txt}        15{c |} {space 3} {res} 12.762537 {space 3} {res} .00575894 {space 3} {res} .00035376  
{txt}        16{c |} {space 3} {res} 11.628748 {space 3} {res} .00571635 {space 3} {res} .00034367  
{txt}        17{c |} {space 3} {res} 10.595682 {space 3} {res} .00567365 {space 3} {res} .00033312  
{txt}        18{c |} {space 3} {res} 9.6543911 {space 3} {res} .00563169 {space 3} {res} .00032285  
{txt}        19{c |} {space 3} {res} 8.7967216 {space 3} {res} .00558916 {space 3} {res} .00031273  ^
{txt}        20{c |} {space 3} {res} 8.0152451 {space 3} {res} .00555189 {space 3} {res} .00030398  
{txt}        21{c |} {space 3} {res} 7.3031928 {space 3} {res} .00551614 {space 3} {res} .00029582  
{txt}        22{c |} {space 3} {res} 6.6543973 {space 3} {res}  .0054842 {space 3} {res} .00028853  
{txt}        23{c |} {space 3} {res}  6.063239 {space 3} {res} .00545554 {space 3} {res} .00028109  
{txt}        24{c |} {space 3} {res} 5.5245976 {space 3} {res} .00543376 {space 3} {res} .00027373  
{txt}        25{c |} {space 3} {res} 5.0338075 {space 3} {res} .00541646 {space 3} {res} .00026706  
{txt}        26{c |} {space 3} {res} 4.5866179 {space 3} {res} .00540234 {space 3} {res} .00026121  
{txt}        27{c |} {space 3} {res} 4.1791554 {space 3} {res} .00539083 {space 3} {res} .00025608  
{txt}        28{c |} {space 3} {res} 3.8078908 {space 3} {res} .00538147 {space 3} {res} .00025161  
{txt}        29{c |} {space 3} {res} 3.4696083 {space 3} {res} .00537447 {space 3} {res} .00024786  
{txt}        30{c |} {space 3} {res} 3.1613778 {space 3} {res} .00536953 {space 3} {res} .00024474  
{txt}        31{c |} {space 3} {res} 2.8805297 {space 3} {res} .00536569 {space 3} {res} .00024204  
{txt}        32{c |} {space 3} {res} 2.6246314 {space 3} {res} .00536274 {space 3} {res}  .0002397  
{txt}        33{c |} {space 3} {res} 2.3914664 {space 3} {res} .00536129 {space 3} {res} .00023773  
{txt}        34{c |} {space 3} {res} 2.1790151 {space 3} {res}  .0053607 {space 3} {res} .00023603  
{txt}        35{c |} {space 3} {res} 1.9854374 {space 3} {res} .00536049 {space 3} {res} .00023456  *
{txt}        36{c |} {space 3} {res} 1.8090566 {space 3} {res}  .0053616 {space 3} {res} .00023354  
{txt}        37{c |} {space 3} {res}  1.648345 {space 3} {res} .00536378 {space 3} {res} .00023229  
{txt}        38{c |} {space 3} {res} 1.5019106 {space 3} {res} .00536851 {space 3} {res} .00023011  
{txt}        39{c |} {space 3} {res}  1.368485 {space 3} {res}  .0053741 {space 3} {res} .00022843  
{txt}        40{c |} {space 3} {res} 1.2469126 {space 3} {res} .00537969 {space 3} {res} .00022697  
{txt}        41{c |} {space 3} {res} 1.1361403 {space 3} {res} .00538588 {space 3} {res} .00022581  
{txt}        42{c |} {space 3} {res} 1.0352087 {space 3} {res} .00539219 {space 3} {res} .00022482  
{txt}        43{c |} {space 3} {res} .94324363 {space 3} {res} .00539811 {space 3} {res} .00022394  
{txt}        44{c |} {space 3} {res} .85944846 {space 3} {res} .00540365 {space 3} {res} .00022315  
{txt}        45{c |} {space 3} {res} .78309743 {space 3} {res} .00540967 {space 3} {res} .00022263  
{txt}        46{c |} {space 3} {res} .71352921 {space 3} {res}  .0054163 {space 3} {res} .00022214  
{txt}        47{c |} {space 3} {res} .65014124 {space 3} {res} .00542284 {space 3} {res} .00022161  
{txt}        48{c |} {space 3} {res} .59238449 {space 3} {res} .00542906 {space 3} {res} .00022113  
{txt}        49{c |} {space 3} {res} .53975868 {space 3} {res} .00543495 {space 3} {res} .00022071  
{txt}        50{c |} {space 3} {res} .49180801 {space 3} {res} .00544044 {space 3} {res} .00022032  
{txt}        51{c |} {space 3} {res} .44811714 {space 3} {res} .00544564 {space 3} {res} .00021997  
{txt}        52{c |} {space 3} {res} .40830765 {space 3} {res} .00545058 {space 3} {res} .00021961  
{txt}        53{c |} {space 3} {res} .37203472 {space 3} {res}   .005455 {space 3} {res} .00021921  
{txt}        54{c |} {space 3} {res} .33898418 {space 3} {res} .00545904 {space 3} {res} .00021881  
{txt}        55{c |} {space 3} {res} .30886976 {space 3} {res}  .0054628 {space 3} {res} .00021846  
{txt}        56{c |} {space 3} {res} .28143062 {space 3} {res}  .0054662 {space 3} {res} .00021811  
{txt}        57{c |} {space 3} {res}  .2564291 {space 3} {res} .00546937 {space 3} {res} .00021779  
{txt}        58{c |} {space 3} {res} .23364865 {space 3} {res} .00547234 {space 3} {res} .00021749  
{txt}        59{c |} {space 3} {res} .21289195 {space 3} {res} .00547504 {space 3} {res} .00021723  
{txt}        60{c |} {space 3} {res} .19397921 {space 3} {res} .00547749 {space 3} {res}   .000217  
{txt}        61{c |} {space 3} {res} .17674663 {space 3} {res} .00547977 {space 3} {res}  .0002168  
{txt}        62{c |} {space 3} {res} .16104495 {space 3} {res} .00548186 {space 3} {res} .00021661  
{txt}        63{c |} {space 3} {res} .14673816 {space 3} {res} .00548379 {space 3} {res} .00021644  
{txt}        64{c |} {space 3} {res} .13370235 {space 3} {res} .00548546 {space 3} {res} .00021627  
{txt}        65{c |} {space 3} {res}  .1218246 {space 3} {res} .00548693 {space 3} {res} .00021611  
{txt}        66{c |} {space 3} {res} .11100204 {space 3} {res}  .0054883 {space 3} {res} .00021597  
{txt}        67{c |} {space 3} {res} .10114092 {space 3} {res} .00548956 {space 3} {res} .00021584  
{txt}        68{c |} {space 3} {res} .09215584 {space 3} {res}  .0054907 {space 3} {res} .00021572  
{txt}        69{c |} {space 3} {res} .08396897 {space 3} {res} .00549175 {space 3} {res} .00021561  
{txt}        70{c |} {space 3} {res}  .0765094 {space 3} {res} .00549272 {space 3} {res} .00021552  
{txt}        71{c |} {space 3} {res} .06971251 {space 3} {res}  .0054936 {space 3} {res} .00021543  
{txt}        72{c |} {space 3} {res} .06351945 {space 3} {res}  .0054944 {space 3} {res} .00021535  
{txt}        73{c |} {space 3} {res} .05787655 {space 3} {res} .00549514 {space 3} {res} .00021528  
{txt}        74{c |} {space 3} {res} .05273496 {space 3} {res} .00549581 {space 3} {res} .00021521  
{txt}        75{c |} {space 3} {res} .04805013 {space 3} {res} .00549642 {space 3} {res} .00021515  
{txt}        76{c |} {space 3} {res} .04378149 {space 3} {res} .00549698 {space 3} {res}  .0002151  
{txt}        77{c |} {space 3} {res} .03989206 {space 3} {res}  .0054975 {space 3} {res} .00021505  
{txt}        78{c |} {space 3} {res} .03634816 {space 3} {res} .00549796 {space 3} {res}   .000215  
{txt}        79{c |} {space 3} {res} .03311909 {space 3} {res} .00549839 {space 3} {res} .00021496  
{txt}        80{c |} {space 3} {res} .03017688 {space 3} {res} .00549878 {space 3} {res} .00021493  
{txt}        81{c |} {space 3} {res} .02749605 {space 3} {res} .00549914 {space 3} {res} .00021489  
{txt}        82{c |} {space 3} {res} .02505338 {space 3} {res} .00549946 {space 3} {res} .00021486  
{txt}        83{c |} {space 3} {res} .02282771 {space 3} {res} .00549976 {space 3} {res} .00021483  
{txt}        84{c |} {space 3} {res} .02079976 {space 3} {res} .00550003 {space 3} {res} .00021481  
{txt}        85{c |} {space 3} {res} .01895196 {space 3} {res} .00550027 {space 3} {res} .00021478  
{txt}        86{c |} {space 3} {res} .01726832 {space 3} {res}  .0055005 {space 3} {res} .00021476  
{txt}        87{c |} {space 3} {res} .01573425 {space 3} {res}  .0055007 {space 3} {res} .00021474  
{txt}        88{c |} {space 3} {res} .01433646 {space 3} {res} .00550089 {space 3} {res} .00021472  
{txt}        89{c |} {space 3} {res} .01306285 {space 3} {res} .00550106 {space 3} {res} .00021471  
{txt}        90{c |} {space 3} {res} .01190238 {space 3} {res} .00550121 {space 3} {res} .00021469  
{txt}        91{c |} {space 3} {res} .01084501 {space 3} {res} .00550136 {space 3} {res} .00021468  
{txt}        92{c |} {space 3} {res} .00988157 {space 3} {res} .00550148 {space 3} {res} .00021467  
{txt}        93{c |} {space 3} {res} .00900372 {space 3} {res}  .0055016 {space 3} {res} .00021466  
{txt}        94{c |} {space 3} {res} .00820385 {space 3} {res} .00550171 {space 3} {res} .00021465  
{txt}        95{c |} {space 3} {res} .00747504 {space 3} {res} .00550181 {space 3} {res} .00021464  
{txt}        96{c |} {space 3} {res} .00681098 {space 3} {res}  .0055019 {space 3} {res} .00021463  
{txt}        97{c |} {space 3} {res} .00620591 {space 3} {res} .00550198 {space 3} {res} .00021462  
{txt}        98{c |} {space 3} {res}  .0056546 {space 3} {res} .00550205 {space 3} {res} .00021461  
{txt}        99{c |} {space 3} {res} .00515226 {space 3} {res} .00550212 {space 3} {res} .00021461  
{txt}       100{c |} {space 3} {res} .00469455 {space 3} {res} .00550218 {space 3} {res}  .0002146  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=1.21 9:09:28

{com}. assert "`e(noftools)'"=="noftools"
{txt}r; t=0.00 9:09:28

{com}. savedresults comp ftools e(), exclude(macros: lasso2opt)
{txt}r; t=0.00 9:09:28

{com}. 
. ********************************************************************************
. ***  check residuals with fe                                                                                             ***
. ********************************************************************************
.                 
. clear
{txt}r; t=0.00 9:09:28

{com}. use https://www.stata-press.com/data/r16/nlswork
{txt}(National Longitudinal Survey.  Young Women 14-26 years of age in 1968)
r; t=1.70 9:09:30

{com}. 
. replace ln_w = . if year == 80
{txt}(1,847 real changes made, 1,847 to missing)
r; t=0.00 9:09:30

{com}. 
. cvlasso ln_w grade age c.age#c.age ttl_exp c.ttl_exp#c.ttl_exp tenure ///
>                 c.tenure#c.tenure 2.race not_smsa south , fe   

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 5773.8216 {space 3} {res} .19857317 {space 3} {res} .00494995  
{txt}         2{c |} {space 3} {res} 5260.8912 {space 3} {res} .19510395 {space 3} {res}   .004921  
{txt}         3{c |} {space 3} {res} 4793.5281 {space 3} {res} .19181949 {space 3} {res} .00489047  
{txt}         4{c |} {space 3} {res} 4367.6843 {space 3} {res} .18901926 {space 3} {res} .00486368  
{txt}         5{c |} {space 3} {res} 3979.6712 {space 3} {res} .18662756 {space 3} {res} .00484006  
{txt}         6{c |} {space 3} {res} 3626.1282 {space 3} {res} .18458098 {space 3} {res} .00481916  
{txt}         7{c |} {space 3} {res}  3303.993 {space 3} {res} .18282633 {space 3} {res}  .0048006  
{txt}         8{c |} {space 3} {res} 3010.4753 {space 3} {res} .18130821 {space 3} {res} .00478317  
{txt}         9{c |} {space 3} {res}  2743.033 {space 3} {res} .17993596 {space 3} {res}   .004778  
{txt}        10{c |} {space 3} {res} 2499.3495 {space 3} {res} .17872966 {space 3} {res} .00477046  
{txt}        11{c |} {space 3} {res} 2277.3142 {space 3} {res} .17769003 {space 3} {res} .00476308  
{txt}        12{c |} {space 3} {res} 2075.0039 {space 3} {res} .17679373 {space 3} {res} .00475651  
{txt}        13{c |} {space 3} {res} 1890.6663 {space 3} {res} .17601938 {space 3} {res} .00475064  
{txt}        14{c |} {space 3} {res} 1722.7047 {space 3} {res} .17534895 {space 3} {res} .00474538  
{txt}        15{c |} {space 3} {res} 1569.6643 {space 3} {res} .17476725 {space 3} {res} .00474066  
{txt}        16{c |} {space 3} {res} 1430.2197 {space 3} {res} .17426144 {space 3} {res} .00473641  
{txt}        17{c |} {space 3} {res} 1303.1629 {space 3} {res} .17382067 {space 3} {res} .00473259  
{txt}        18{c |} {space 3} {res} 1187.3935 {space 3} {res} .17343575 {space 3} {res} .00472914  
{txt}        19{c |} {space 3} {res} 1081.9087 {space 3} {res} .17309888 {space 3} {res} .00472603  
{txt}        20{c |} {space 3} {res} 985.79495 {space 3} {res} .17280815 {space 3} {res} .00472298  
{txt}        21{c |} {space 3} {res} 898.21965 {space 3} {res} .17259251 {space 3} {res} .00472315  
{txt}        22{c |} {space 3} {res} 818.42429 {space 3} {res}  .1724332 {space 3} {res} .00472221  
{txt}        23{c |} {space 3} {res} 745.71773 {space 3} {res} .17229934 {space 3} {res} .00471979  
{txt}        24{c |} {space 3} {res} 679.47022 {space 3} {res} .17218835 {space 3} {res} .00471767  
{txt}        25{c |} {space 3} {res} 619.10796 {space 3} {res} .17211746 {space 3} {res} .00471512  
{txt}        26{c |} {space 3} {res} 564.10812 {space 3} {res} .17210298 {space 3} {res} .00471618  
{txt}        27{c |} {space 3} {res} 513.99431 {space 3} {res} .17214254 {space 3} {res} .00471385  
{txt}        28{c |} {space 3} {res} 468.33247 {space 3} {res} .17222045 {space 3} {res} .00471808  
{txt}        29{c |} {space 3} {res}  426.7271 {space 3} {res} .17227899 {space 3} {res} .00472739  
{txt}        30{c |} {space 3} {res} 388.81784 {space 3} {res} .17192789 {space 3} {res}  .0047269  
{txt}        31{c |} {space 3} {res} 354.27634 {space 3} {res} .17159449 {space 3} {res} .00471671  
{txt}        32{c |} {space 3} {res}  322.8034 {space 3} {res} .17131531 {space 3} {res} .00470748  
{txt}        33{c |} {space 3} {res} 294.12644 {space 3} {res} .17108137 {space 3} {res} .00469911  
{txt}        34{c |} {space 3} {res} 267.99706 {space 3} {res} .17088517 {space 3} {res} .00469151  
{txt}        35{c |} {space 3} {res} 244.18894 {space 3} {res} .17072048 {space 3} {res} .00468461  
{txt}        36{c |} {space 3} {res} 222.49586 {space 3} {res} .17058212 {space 3} {res} .00467835  
{txt}        37{c |} {space 3} {res} 202.72995 {space 3} {res} .17045879 {space 3} {res} .00466925  
{txt}        38{c |} {space 3} {res} 184.71998 {space 3} {res} .17012504 {space 3} {res} .00464464  
{txt}        39{c |} {space 3} {res} 168.30996 {space 3} {res} .16961144 {space 3} {res} .00463218  
{txt}        40{c |} {space 3} {res} 153.35777 {space 3} {res}  .1691905 {space 3} {res} .00461934  
{txt}        41{c |} {space 3} {res} 139.73389 {space 3} {res}  .1688505 {space 3} {res} .00460775  
{txt}        42{c |} {space 3} {res} 127.32031 {space 3} {res} .16857686 {space 3} {res} .00459728  
{txt}        43{c |} {space 3} {res} 116.00953 {space 3} {res} .16835755 {space 3} {res}  .0045878  
{txt}        44{c |} {space 3} {res} 105.70356 {space 3} {res} .16818264 {space 3} {res} .00457922  
{txt}        45{c |} {space 3} {res} 96.313148 {space 3} {res} .16804395 {space 3} {res} .00457145  
{txt}        46{c |} {space 3} {res} 87.756954 {space 3} {res} .16792749 {space 3} {res} .00456247  
{txt}        47{c |} {space 3} {res} 79.960868 {space 3} {res} .16899955 {space 3} {res} .00482274  
{txt}        48{c |} {space 3} {res} 72.857365 {space 3} {res} .17222462 {space 3} {res} .00490454  
{txt}        49{c |} {space 3} {res} 66.384917 {space 3} {res} .17293706 {space 3} {res} .00484796  
{txt}        50{c |} {space 3} {res} 60.487464 {space 3} {res} .16962573 {space 3} {res} .00475823  
{txt}        51{c |} {space 3} {res} 55.113925 {space 3} {res} .16653555 {space 3} {res} .00459894  
{txt}        52{c |} {space 3} {res} 50.217755 {space 3} {res} .16384018 {space 3} {res} .00447405  
{txt}        53{c |} {space 3} {res} 45.756548 {space 3} {res} .16143366 {space 3} {res} .00435624  
{txt}        54{c |} {space 3} {res} 41.691663 {space 3} {res} .15935865 {space 3} {res} .00426164  
{txt}        55{c |} {space 3} {res}  37.98789 {space 3} {res} .15751174 {space 3} {res} .00417773  
{txt}        56{c |} {space 3} {res} 34.613151 {space 3} {res} .15590529 {space 3} {res} .00410194  
{txt}        57{c |} {space 3} {res} 31.538214 {space 3} {res} .15447877 {space 3} {res} .00403925  
{txt}        58{c |} {space 3} {res} 28.736446 {space 3} {res} .15320056 {space 3} {res} .00398367  
{txt}        59{c |} {space 3} {res} 26.183579 {space 3} {res} .15205381 {space 3} {res} .00393431  
{txt}        60{c |} {space 3} {res} 23.857502 {space 3} {res}  .1510238 {space 3} {res} .00389038  
{txt}        61{c |} {space 3} {res} 21.738068 {space 3} {res} .15009765 {space 3} {res} .00385122  
{txt}        62{c |} {space 3} {res} 19.806918 {space 3} {res} .14927115 {space 3} {res} .00381774  
{txt}        63{c |} {space 3} {res} 18.047326 {space 3} {res} .14852849 {space 3} {res} .00378817  
{txt}        64{c |} {space 3} {res} 16.444051 {space 3} {res} .14785867 {space 3} {res} .00376163  
{txt}        65{c |} {space 3} {res} 14.983207 {space 3} {res} .14725405 {space 3} {res} .00373777  
{txt}        66{c |} {space 3} {res}  13.65214 {space 3} {res} .14668904 {space 3} {res} .00372033  
{txt}        67{c |} {space 3} {res} 12.439321 {space 3} {res} .14615426 {space 3} {res} .00370471  
{txt}        68{c |} {space 3} {res} 11.334246 {space 3} {res} .14565719 {space 3} {res} .00368253  
{txt}        69{c |} {space 3} {res} 10.327343 {space 3} {res} .14517512 {space 3} {res} .00366641  
{txt}        70{c |} {space 3} {res} 9.4098905 {space 3} {res} .14473941 {space 3} {res} .00365267  
{txt}        71{c |} {space 3} {res} 8.5739418 {space 3} {res}  .1442923 {space 3} {res} .00364945  
{txt}        72{c |} {space 3} {res} 7.8122564 {space 3} {res}  .1438574 {space 3} {res} .00364346  
{txt}        73{c |} {space 3} {res} 7.1182371 {space 3} {res}  .1434891 {space 3} {res} .00363163  
{txt}        74{c |} {space 3} {res} 6.4858725 {space 3} {res} .14311765 {space 3} {res} .00359787  ^
{txt}        75{c |} {space 3} {res} 5.9096855 {space 3} {res}   .142813 {space 3} {res} .00358589  
{txt}        76{c |} {space 3} {res} 5.3846853 {space 3} {res} .14248015 {space 3} {res}  .0035886  
{txt}        77{c |} {space 3} {res} 4.9063247 {space 3} {res} .14222273 {space 3} {res}  .0035796  
{txt}        78{c |} {space 3} {res} 4.4704603 {space 3} {res} .14198358 {space 3} {res} .00357021  
{txt}        79{c |} {space 3} {res}  4.073317 {space 3} {res} .14176682 {space 3} {res} .00356173  
{txt}        80{c |} {space 3} {res} 3.7114547 {space 3} {res} .14157026 {space 3} {res} .00355407  
{txt}        81{c |} {space 3} {res} 3.3817393 {space 3} {res} .14135056 {space 3} {res} .00354919  
{txt}        82{c |} {space 3} {res} 3.0813149 {space 3} {res} .14111475 {space 3} {res}  .0035564  
{txt}        83{c |} {space 3} {res} 2.8075794 {space 3} {res} .14096201 {space 3} {res} .00355144  
{txt}        84{c |} {space 3} {res} 2.5581618 {space 3} {res} .14079967 {space 3} {res} .00353605  
{txt}        85{c |} {space 3} {res} 2.3309017 {space 3} {res} .14067249 {space 3} {res} .00353149  
{txt}        86{c |} {space 3} {res} 2.1238308 {space 3} {res} .14055688 {space 3} {res} .00352734  
{txt}        87{c |} {space 3} {res} 1.9351556 {space 3} {res} .14045176 {space 3} {res} .00352358  
{txt}        88{c |} {space 3} {res} 1.7632417 {space 3} {res} .14035617 {space 3} {res} .00352016  
{txt}        89{c |} {space 3} {res} 1.6066001 {space 3} {res} .14026922 {space 3} {res} .00351706  
{txt}        90{c |} {space 3} {res} 1.4638742 {space 3} {res} .14019012 {space 3} {res} .00351424  
{txt}        91{c |} {space 3} {res} 1.3338277 {space 3} {res} .14011815 {space 3} {res} .00351167  
{txt}        92{c |} {space 3} {res} 1.2153341 {space 3} {res} .14005267 {space 3} {res} .00350934  
{txt}        93{c |} {space 3} {res} 1.1073672 {space 3} {res} .13999307 {space 3} {res} .00350722  
{txt}        94{c |} {space 3} {res} 1.0089917 {space 3} {res} .13993883 {space 3} {res} .00350529  
{txt}        95{c |} {space 3} {res} .91935567 {space 3} {res} .13988946 {space 3} {res} .00350354  
{txt}        96{c |} {space 3} {res} .83768265 {space 3} {res} .13984452 {space 3} {res} .00350194  
{txt}        97{c |} {space 3} {res} .76326523 {space 3} {res}  .1398036 {space 3} {res} .00350049  
{txt}        98{c |} {space 3} {res} .69545885 {space 3} {res} .13976635 {space 3} {res} .00349917  
{txt}        99{c |} {space 3} {res}  .6336762 {space 3} {res} .13973243 {space 3} {res} .00349797  
{txt}       100{c |} {space 3} {res} .57738216 {space 3} {res} .13970154 {space 3} {res} .00349688  *
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lopt is at the limit of the lambda range.
{txt}r; t=7.56 9:09:37

{com}. cvlasso, lse postres ols        
{txt}Estimate lasso with lambda=6.486 (lse).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 14}age {c |}{col 21}{res}      0.0308853      0.0330033
{txt}{space 17} {c |}
{space 6}c.age#c.age {c |}{col 21}{res}     -0.0006394     -0.0006806
{txt}{space 17} {c |}
{space 10}ttl_exp {c |}{col 21}{res}      0.0356063      0.0372828
{txt}{space 11}tenure {c |}{col 21}{res}      0.0361441      0.0357082
{txt}{space 17} {c |}
c.tenure#c.tenure {c |}{col 21}{res}     -0.0019446     -0.0019142
{txt}{space 17} {c |}
{space 9}not_smsa {c |}{col 21}{res}     -0.0895293     -0.0899220
{txt}{space 12}south {c |}{col 21}{res}     -0.0599539     -0.0605564
{txt}{hline 18}{c BT}{hline 32}
r; t=0.19 9:09:37

{com}.                 
. local sel = e(selected)
{txt}r; t=0.00 9:09:37

{com}. di "`sel'"
{res}age c.age#c.age ttl_exp tenure c.tenure#c.tenure not_smsa south
{txt}r; t=0.00 9:09:37

{com}. 
. predict double uehat  , ue noi  
{txt}Use e(b) from previous lasso2 estimation (lambda=6.485872520913).
(2,253 missing values generated)
Beta used for predict:
{res}{txt}                     c.age#                           c.tenure#            
           age       c.age     ttl_exp      tenure    c.tenure    not_smsa
y1 {res}   .0330033  -.00068058   .03728278    .0357082  -.00191421  -.08992203

{txt}               
         south
y1 {res} -.06055644
{reset}r; t=0.04 9:09:37

{com}. predict double ehat  , e noi  
{txt}Use e(b) from previous lasso2 estimation (lambda=6.485872520913).
{res}{txt}(2,255 missing values generated)
Beta used for predict:
{res}{txt}                     c.age#                           c.tenure#            
           age       c.age     ttl_exp      tenure    c.tenure    not_smsa
y1 {res}   .0330033  -.00068058   .03728278    .0357082  -.00191421  -.08992203

{txt}               
         south
y1 {res} -.06055644
{reset}r; t=0.07 9:09:37

{com}. predict double xbhat  , xb noi  
{txt}Use e(b) from previous lasso2 estimation (lambda=6.485872520913).
(441 missing values generated)
Beta used for predict:
{res}{txt}                     c.age#                           c.tenure#            
           age       c.age     ttl_exp      tenure    c.tenure    not_smsa
y1 {res}   .0330033  -.00068058   .03728278    .0357082  -.00191421  -.08992203

{txt}               
         south
y1 {res} -.06055644
{reset}r; t=0.09 9:09:38

{com}. predict double xbuhat  , xbu noi  
{txt}Use e(b) from previous lasso2 estimation (lambda=6.485872520913).
{res}{txt}(2,255 missing values generated)
Beta used for predict:
{res}{txt}                     c.age#                           c.tenure#            
           age       c.age     ttl_exp      tenure    c.tenure    not_smsa
y1 {res}   .0330033  -.00068058   .03728278    .0357082  -.00191421  -.08992203

{txt}               
         south
y1 {res} -.06055644
{reset}r; t=0.07 9:09:38

{com}. predict double uhat  , u noi  
{txt}Use e(b) from previous lasso2 estimation (lambda=6.485872520913).
(2,255 missing values generated)
{res}Beta used for predict:
{txt}                     c.age#                           c.tenure#            
           age       c.age     ttl_exp      tenure    c.tenure    not_smsa
y1 {res}   .0330033  -.00068058   .03728278    .0357082  -.00191421  -.08992203

{txt}               
         south
y1 {res} -.06055644
{reset}r; t=0.08 9:09:38

{com}. 
. xtreg ln_w `sel' if e(sample), fe 
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    26,279
{txt}Group variable: {res}idcode{txt}{col 49}Number of groups{col 67}={col 69}{res}     4,686

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1786{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.3530{col 63}{txt}avg{col 67}={col 69}{res}       5.6
{txt}     overall = {res}0.2662{col 63}{txt}max{col 67}={col 69}{res}        14

{txt}{col 49}F({res}7{txt},{res}21586{txt}){col 67}={col 70}{res}   670.64
{txt}corr(u_i, Xb){col 16}= {res}0.1930{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     ln_wage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .0330033{col 26}{space 2} .0029458{col 37}{space 1}   11.20{col 46}{space 3}0.000{col 54}{space 4} .0272294{col 67}{space 3} .0387772
{txt}{space 12} {c |}
{space 1}c.age#c.age {c |}{col 14}{res}{space 2}-.0006806{col 26}{space 2} .0000487{col 37}{space 1}  -13.97{col 46}{space 3}0.000{col 54}{space 4}-.0007761{col 67}{space 3}-.0005851
{txt}{space 12} {c |}
{space 5}ttl_exp {c |}{col 14}{res}{space 2} .0372828{col 26}{space 2} .0015061{col 37}{space 1}   24.75{col 46}{space 3}0.000{col 54}{space 4} .0343307{col 67}{space 3} .0402349
{txt}{space 6}tenure {c |}{col 14}{res}{space 2} .0357082{col 26}{space 2} .0017123{col 37}{space 1}   20.85{col 46}{space 3}0.000{col 54}{space 4}  .032352{col 67}{space 3} .0390644
{txt}{space 12} {c |}
{space 4}c.tenure#{c |}
{space 4}c.tenure {c |}{col 14}{res}{space 2}-.0019142{col 26}{space 2} .0001095{col 37}{space 1}  -17.47{col 46}{space 3}0.000{col 54}{space 4}-.0021289{col 67}{space 3}-.0016995
{txt}{space 12} {c |}
{space 4}not_smsa {c |}{col 14}{res}{space 2} -.089922{col 26}{space 2} .0099008{col 37}{space 1}   -9.08{col 46}{space 3}0.000{col 54}{space 4}-.1093284{col 67}{space 3}-.0705157
{txt}{space 7}south {c |}{col 14}{res}{space 2}-.0605564{col 26}{space 2} .0114483{col 37}{space 1}   -5.29{col 46}{space 3}0.000{col 54}{space 4}-.0829959{col 67}{space 3} -.038117
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.074643{col 26}{space 2} .0433838{col 37}{space 1}   24.77{col 46}{space 3}0.000{col 54}{space 4} .9896076{col 67}{space 3} 1.159678
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .35740248
     {txt}sigma_e {c |} {res} .29207998
         {txt}rho {c |} {res} .59956903{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}4685{txt}, {res}21586{txt}) = {res}6.23{col 62}{txt}Prob > F = {res}0.0000
{txt}r; t=0.32 9:09:38

{com}. mat bxtreg = e(b)
{txt}r; t=0.00 9:09:38

{com}. 
. predict double uehat_xtreg   , ue  
{txt}(2,253 missing values generated)
r; t=0.01 9:09:38

{com}. predict double ehat_xtreg   , e 
{txt}(2,255 missing values generated)
r; t=0.11 9:09:38

{com}. predict double xbhat_xtreg  , xb
{txt}(441 missing values generated)
r; t=0.01 9:09:38

{com}. predict double xbuhat_xtreg  , xbu
{txt}(2,255 missing values generated)
r; t=0.10 9:09:38

{com}. predict double uhat_xtreg  , u
{txt}(2,255 missing values generated)
r; t=0.13 9:09:38

{com}. 
. assert abs(ehat_xtreg-ehat)<10e-8 | (missing(ehat_xtreg) | missing(ehat))
{txt}r; t=0.00 9:09:38

{com}. assert abs(uehat_xtreg-uehat)<10e-8 | (missing(uehat_xtreg) | missing(uehat)) 
{txt}r; t=0.00 9:09:38

{com}. assert abs(xbhat_xtreg-xbhat)<10e-8 | (missing(xbhat_xtreg) | missing(xbhat))
{txt}r; t=0.00 9:09:38

{com}. assert abs(xbuhat_xtreg-xbuhat)<10e-8 | (missing(xbuhat_xtreg) | missing(xbuhat))
{txt}r; t=0.00 9:09:38

{com}. assert abs(uhat_xtreg-uhat)<10e-8 | (missing(uhat_xtreg) | missing(uhat))
{txt}r; t=0.00 9:09:38

{com}. 
. 
. ********************************************************************************
. *** finish                                                                   ***
. ********************************************************************************
. 
. cap log close
{smcl}
{com}{sf}{ul off}